[
    {
        "name": "Blink",
        "desc": "<p>Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane). At the start of your next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that range, you appear in the nearest unoccupied space (chosen at random if more than one space is equally near). You can dismiss this spell as an action.</p><p>While on the Ethereal Plane, you can see and hear the plane you originated from, which is cast in shades of gray, and you can’t see anything there more than 60 feet away. You can only affect and be affected by other creatures on the Ethereal Plane. Creatures that aren’t there can’t perceive you or interact with you, unless they have the ability to do so.</p>",
        "page": "phb 219",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery<br/> Warlock: Archfey",
        "domains": "Trickery",
        "patrons": "Archfey"
    },
    {
        "name": "Clairvoyance",
        "desc": "<p>You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can’t be attacked or otherwise interacted with.</p><p>When you cast the spell, you choose seeing or hearing. You can use the chosen sense through the sensor as if you were in its space. As your action, you can switch between seeing and hearing.</p><p>A creature that can see the sensor (such as a creature benefiting from see invisibility or truesight) sees a luminous, intangible orb about the size of your fist.</p>",
        "page": "phb 222",
        "range": "1 mile",
        "components": "V, S, M",
        "material": "A focus worth at least 100gp, either a jeweled horn for hearing or a glass eye for seeing.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "10 minutes",
        "level": "3rd-level",
        "school": "Divination",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Great Old One",
        "patrons": "Great Old One"
    },
    {
        "name": "Counterspell",
        "desc": "<p>You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.</p>",
        "page": "phb 228",
        "range": "60 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 reaction",
        "level": "3rd-level",
        "school": "Abjuration",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Dispel Magic",
        "desc": "<p>Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a successful check, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell’s level is equal to or less than the level of the spell slot you used.</p>",
        "page": "phb 234",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Abjuration",
        "class": "Bard, Cleric, Druid, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery",
        "domains": "Trickery",
        "oaths": "Devotion"
    },
    {
        "name": "Fear",
        "desc": "<p>You project a phantasmal image of a creature’s worst fears. Each creature in a 30-foot cone must succeed on a wisdom saving throw or drop whatever it is holding and become frightened for the duration.</p><p>While frightened by this spell, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn’t have line of sight to you, the creature can make a wisdom saving throw. On a successful save, the spell ends for that creature.</p>",
        "page": "phb 239",
        "range": "Self",
        "components": "V, S, M",
        "material": "A white feather or the heart of a hen.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Fireball",
        "desc": "<p>A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.</p><p>The fire spreads around corners. It ignites flammable objects in the area that aren’t being worn or carried.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.</p>",
        "page": "phb 241",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "A tiny ball of bat guano and sulfur.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Evocation",
        "class": "Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Light<br/> Warlock: Fiend",
        "domains": "Light",
        "patrons": "Fiend"
    },
    {
        "name": "Fly",
        "desc": "<p>You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.</p>",
        "page": "phb 243",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A wing feather from any bird.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Gaseous Form",
        "desc": "<p>You transform a willing creature you touch, along with everything it’s wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn’t affected.</p><p>While in this form, the target’s only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and constitution saving throws. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can’t fall and remains hovering in the air even when stunned or otherwise incapacitated.</p><p>While in the form of a misty cloud, the target can’t talk or manipulate objects, and any objects it was carrying or holding can’t be dropped, used, or otherwise interacted with. The target can’t attack or cast spells.</p>",
        "page": "phb 244",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A bit of gauze and a wisp of smoke.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Underdark",
        "circles": "Underdark"
    },
    {
        "name": "Hunger of Hadar",
        "desc": "<p>You open a gateway to the dark between the stars, a region infested with unknown horrors. A 20-foot-radius sphere of blackness and bitter cold appears, centered on a point with range and lasting for the duration. This void is filled with a cacophony of soft whispers and slurping noises that can be heard up to 30 feet away. No light, magical or otherwise, can illuminate the area, and creatures fully within the area are blinded.</p><p>The void creates a warp in the fabric of space, and the area is difficult terrain. Any creature that starts its turn in the area takes 2d6 cold damage. Any creature that ends its turn in the area must succeed on a dexterity saving throw or take 2d6 acid damage as milky, otherworldly tentacles rub against it.</p>",
        "page": "phb 251",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "A pickled octopus tentacle.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Conjuration",
        "class": "Warlock"
    },
    {
        "name": "Hypnotic Pattern",
        "desc": "<p>You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0.</p><p>The spell ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor.</p>",
        "page": "phb 252",
        "range": "120 feet",
        "components": "S, M",
        "material": "A glowing stick of incense or a crystal vial filled with phosphorescent material.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Magic Circle",
        "desc": "<p>Choose one or more of the following types of creatures: celestials, elementals, fey, fiends, or undead. The circle affects a creature of the chosen type in the following ways:</p><p>- The creature can’t willingly enter the cylinder by nonmagical means. If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a charisma saving throw.</p><p>- The creature has disadvantage on attack rolls against targets within the cylinder.</p><p>- Targets within the cylinder can’t be charmed, frightened, or possessed by the creature.</p><p>When you cast this spell, you can elect to cause its magic to operate in the reverse direction, preventing a creature of the specified type from leaving the cylinder and protecting targets outside it.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 hour for each slot level above 3rd.</p>",
        "page": "phb 256",
        "range": "10 feet",
        "components": "V, S, M",
        "material": "Holy water or powdered silver and iron worth at least 100 gp, which the spell consumes.",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "3rd-level",
        "school": "Abjuration",
        "class": "Cleric, Paladin, Warlock, Wizard"
    },
    {
        "name": "Major Image",
        "desc": "<p>You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench).</p><p>As long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.</p><p>Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 6th level or higher, the spell lasts until dispelled, without requiring your concentration.</p>",
        "page": "phb 258",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A bit of fleece.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Plant Growth",
        "desc": "<p>This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits.</p><p>If you cast this spell using 1 action, choose a point within range. All normal plants in a 100-foot radius centered on that point become thick and overgrown. A creature moving through the area must spend 4 feet of movement for every 1 foot it moves.</p><p>You can exclude one or more areas of any size within the spell’s area from being affected.</p><p>If you cast this spell over 8 hours, you enrich the land. All plants in a half-mile radius centered on a point within range become enriched for 1 year. The plants yield twice the normal amount of food when harvested.</p>",
        "page": "phb 266",
        "range": "150 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Bard, Cleric, Druid, Paladin, Ranger, Warlock",
        "archetype": "Cleric: Nature<br/> Paladin: Ancients<br/> Warlock: Archfey",
        "domains": "Nature",
        "circles": "Forest",
        "oaths": "Ancients",
        "patrons": "Archfey"
    },
    {
        "name": "Remove Curse",
        "desc": "<p>At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner’s attunement to the object so it can be removed or discarded.</p>",
        "page": "phb 271",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Abjuration",
        "class": "Cleric, Paladin, Warlock, Wizard"
    },
    {
        "name": "Sending",
        "desc": "<p>You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message.</p><p>You can send the message across any distance and even to other planes of existence, but if the target is on a different plane than you, there is a 5 percent chance that the message doesn’t arrive.</p>",
        "page": "phb 274",
        "range": "Unlimited",
        "components": "V, S, M",
        "material": "A short piece of fine copper wire.",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Evocation",
        "class": "Bard, Cleric, Warlock, Wizard",
        "archetype": "Warlock: Great Old One",
        "patrons": "Great Old One"
    },
    {
        "name": "Stinking Cloud",
        "desc": "<p>You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.</p><p>Each creature that is completely within the cloud at the start of its turn must make a constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don’t need to breathe or are immune to poison automatically succeed on this saving throw.</p><p>A moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round.</p>",
        "page": "phb 278",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A rotten egg or several skunk cabbage leaves.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Conjuration",
        "class": "Bard, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Swamp, Underdark<br/> Warlock: Fiend",
        "circles": "Swamp, Underdark",
        "patrons": "Fiend"
    },
    {
        "name": "Tongues",
        "desc": "<p>This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.</p>",
        "page": "phb 283",
        "range": "Touch",
        "components": "V, M",
        "material": "A small clay model of a ziggurat.",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Divination",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Vampiric Touch",
        "desc": "<p>The touch of your shadow-wreathed hand can siphon life force from others to heal your wounds. Make a melee spell attack against a creature within your reach. On a hit, the target takes 3d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.</p>",
        "page": "phb 285",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Necromancy",
        "class": "Warlock, Wizard"
    }
]