[
    {
        "name": "Blindness/Deafness",
        "desc": "<p>You can blind or deafen a foe. Choose one creature that you can see within range to make a constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a constitution saving throw. On a success, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.</p>",
        "page": "phb 219",
        "range": "30 feet",
        "components": "V",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Necromancy",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Fiend",
        "patrons": "Fiend"
    },
    {
        "name": "Calm Emotions",
        "desc": "<p>You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.</p><p>Alternatively, you can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its friends being harmed. When the spell ends, the creature becomes hostile again, unless the DM rules otherwise.</p>",
        "page": "phb 221",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Warlock",
        "archetype": "Warlock: Archfey",
        "patrons": "Archfey"
    },
    {
        "name": "Cloud of Daggers",
        "desc": "<p>You fill the air with spinning daggers in a cube 5 feet on each side, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell’s area for the first time on a turn or starts its turn there.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d4 for each slot level above 2nd.</p>",
        "page": "phb 222",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A sliver of glass.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Conjuration",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Crown of Madness",
        "desc": "<p>One humanoid of your choice that you can see within range must succeed on a wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes.</p><p>The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose.</p><p>The target can act normally on its turn if you choose no creature or if none are within its reach.</p><p>On your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a wisdom saving throw at the end of each of its turns. On a success, the spell ends.</p>",
        "page": "phb 229",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Darkness",
        "desc": "<p>Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can’t see through this darkness, and nonmagical light can’t illuminate it.</p><p>If the point you choose is on an object you are holding or one that isn’t being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.</p><p>If any of this spell’s area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.</p>",
        "page": "phb 230",
        "range": "60 feet",
        "components": "V, M",
        "material": "Bat fur and a drop of pitch or piece of coal.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Swamp",
        "circles": "Swamp"
    },
    {
        "name": "Detect Thoughts",
        "desc": "<p>For the duration of the spell, you can read the thoughts of some creatures. While casting the spell and at your action in each round until the spell, you may focus your mind on a creature you can see 30 feet of you. If the chosen creature has an Intelligence of 3 or less, or if she does not speak any language, the creature is not affected.</p><p>You first read the surface thoughts of the creature, which occupies her mind at that moment. In an action, you can direct your attention to the thoughts of another creature or attempt to deepen your reading thoughts of the same creature. If you deepen your reading, the target must make a backup of Wisdom, otherwise you get access to his argument (if any), in his emotional state and thought that concerns his mind on a broader spectrum Such a concern, love or hate. If successful, the spell ends. In all cases, the target is aware that his mind is under your eyes. Unless you are directing your attention to the thoughts of another creature, the target can use his action turn to roll Intelligence opposite your roll Intelligence. If she has the upper hand, the spell ends.</p><p>The questions verbally directed to the target guide the train of thought. This spell is especially effective during an interrogation.</p><p>You can also use this spell to detect the presence of thinking creatures that are invisible to you. When you cast this spell, or in an action for the duration of the spell, you can find thoughts to 30 feet of you. The spell can override most obstacles but it is blocked by 2 feet stone 2 inches of precious metal, or a thin sheet of lead. You can not detect a creature with an Intelligence of 3 or less or speaking any language.</p><p>After detecting the presence of a creature in this way, you can read his thoughts for the rest of the spell's duration as described above, even if you can not see it, but only if it remains in the range of the spell.</p>",
        "page": "phb 231",
        "range": "Self",
        "components": "V, S, M",
        "material": "A copper coin.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Divination",
        "class": "Bard, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Great Old One",
        "patrons": "Great Old One"
    },
    {
        "name": "Earthbind",
        "desc": "<p>Choose one creature you can see within range. Yellow strips of magical energy loop around the creature. The target must succeed on a Strength saving throw or its flying speed (if any) is reduced to 0 feet for the spell's duration. An airborne creature affected by this spell descends at 60 feet per round until it reaches the ground or the spell ends.</p>",
        "page": "ee pc 17",
        "range": "300 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Enthrall",
        "desc": "<p>You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a wisdom saving throw. Any creature that can’t be charmed succeeds on this saving throw automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on Wisdom (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you. The spell ends if you are incapacitated or can no longer speak.</p>",
        "page": "phb 238",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Enchantment",
        "class": "Bard, Warlock"
    },
    {
        "name": "Hold Person",
        "desc": "<p>Choose a humanoid that you can see within range. The target must succeed on a wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another wisdom saving throw. On a success, the spell ends on the target.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them.</p>",
        "page": "phb 251",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A small, straight piece of iron.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Druid, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Paladin: Vengeance",
        "circles": "Arctic",
        "oaths": "Vengeance"
    },
    {
        "name": "Invisibility",
        "desc": "<p>A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person. The spell ends for a target that attacks or casts a spell.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.</p>",
        "page": "phb 254",
        "range": "Touch",
        "components": "V, S, M",
        "material": "An eyelash encased in gum arabic.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Illusion",
        "class": "Bard, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Grassland",
        "circles": "Grassland"
    },
    {
        "name": "Mirror Image",
        "desc": "<p>Three illusionary duplicates of yourself appear in your space. Until the end of the spell, duplicates move with you and imitate your actions, swapping their position so that it is impossible to determine which image is real. You can use your action to dispel the illusory duplicates.</p><p>Whenever a creature is targeting you with an attack during the duration of the spell, roll 1d20 to determine if the attack does not target rather one of your duplicates.</p><p>If you have three duplicates, you need 6 or more on your throw to lead the target of the attack to a duplicate. With two duplicates, you need 8 or more. With one duplicate, you need 11 or more.</p><p>The CA of a duplicate is 10 + your Dexterity modifier. If an attack hits a duplicate, it is destroyed. A duplicate may be destroyed not just an attack on key. It ignores other damage and effects. The spell ends if the three duplicates are destroyed.</p><p>A creature is unaffected by this fate if she can not see if it relies on a different meaning as vision, such as blind vision, or if it can perceive illusions as false, as with clear vision.</p>",
        "page": "phb 260",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Illusion",
        "class": "Cleric, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery<br/> Druid: Coast",
        "domains": "Trickery",
        "circles": "Coast"
    },
    {
        "name": "Misty Step",
        "desc": "<p>Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.</p>",
        "page": "phb 260",
        "range": "Self",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 bonus action",
        "level": "2nd-level",
        "school": "Conjuration",
        "class": "Druid, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Coast<br/> Paladin: Ancients, Vengeance",
        "circles": "Coast",
        "oaths": "Ancients, Vengeance"
    },
    {
        "name": "Phantasmal Force",
        "desc": "<p>You craft an illusion that takes root in the mind of a creature that you can see within range. The target must make an intelligence saving throw. On a failed save, you create a phantasmal object, creature, or other visible phenomenon of your choice that is no larger than a 10-foot cube and that is perceivable only to the target for the duration. This spell has no effect on undead or constructs.</p><p>The phantasm includes sound, temperature, and other stimuli, also evident only to the creature.</p><p>The target can use its action to examine the phantasm with an Intelligence (Investigation) check against your spell save DC. If the check succeeds, the target realizes that the phantasm is an illusion, and the spell ends.</p><p>While a target is affected by the spell, the target treats the phantasm as if it were real. The target rationalizes any illogical outcomes from interacting with the phantasm. For example, a target attempting to walk across a phantasmal bridge that spans a chasm falls once it steps onto the bridge. If the target survives the fall, it still believes that the bridge exists and comes up with some other explanation for its fall—it was pushed, it slipped, or a strong wind might have knocked it off.</p><p>An affected target is so convinced of the phantasm's reality that it can even take damage from the illusion. A phantasm created to appear as a creature can attack the target. Similarly, a phantasm created to appear as fire, a pool of acid, or lava can burn the target. Each round on your turn, the phantasm can deal 1d6 psychic damage to the target if it is in the phantasm's area or within 5 feet of the phantasm, provided that the illusion is of a creature or hazard that could logically deal damage, such as by attacking. The target perceives the damage as a type appropriate to the illusion.</p>",
        "page": "phb 264",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A bit of fleece.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Archfey, Great Old One",
        "patrons": "Archfey, Great Old One"
    },
    {
        "name": "Ray of Enfeeblement",
        "desc": "<p>A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends.</p><p>At the end of each of the target’s turns, it can make a constitution saving throw against the spell. On a success, the spell ends.</p>",
        "page": "phb 271",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Necromancy",
        "class": "Warlock, Wizard"
    },
    {
        "name": "Scorching Ray",
        "desc": "<p>You generate three rays of fire and will throw to targets in the range of the spell. You can project them on one or more targets.</p><p>Perform a remote attack spell for each department. If it hits, the target takes 2d6 fire damage.</p>",
        "higher_level": "<p>When you cast this spell using a 3 or higher level spell slot, you generate an additional radius for each level of higher spell slot 2.</p>",
        "page": "phb 273",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Light<br/> Warlock: Fiend",
        "domains": "Light",
        "patrons": "Fiend"
    },
    {
        "name": "Shatter",
        "desc": "<p>A strong resonant sound painfully intense sounds of a desired point in the range of the spell. Each creature has a sphere with a 10-foot-radius sphere centered on that point must make a constitution saving throw or it suffers 3d8 thunder damage. If successful, the damage is halved. A creature made of inorganic materials such as stone, crystal or metal, makes its saving throw with a disadvantage.</p><p>A non-magical item that is not worn or carried also suffers damage if it is in the area of ​​the spell.</p>",
        "higher_level": "<p>When you cast this spell using a 3 or higher level spell slot, the damage of the spell increases by 1d8 for each level of higher spell slot 2.</p>",
        "page": "phb 275",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A burst of mica.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Tempest",
        "domains": "Tempest"
    },
    {
        "name": "Spider Climb",
        "desc": "<p>Until the spell ends, one willing creature you touch gains the ability to move up, down, and across vertical surfaces and upside down along ceilings, while leaving its hands free. The target also gains a climbing speed equal to its walking speed.</p>",
        "page": "phb 277",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A drop of bitumen and a spider.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Forest, Mountain, Underdark",
        "circles": "Forest, Mountain, Underdark"
    },
    {
        "name": "Suggestion",
        "desc": "<p>You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.</p><p>The target must make a wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.</p><p>You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn’t met before the spell expires, the activity isn’t performed.</p><p>If you or any of your companions damage the target, the spell ends.</p>",
        "page": "phb 279",
        "range": "30 feet",
        "components": "V, M",
        "material": "A snake’s tongue and either a bit of honeycomb or a drop of sweet oil.",
        "ritual": "no",
        "duration": "Up to 8 hours",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Knowledge",
        "domains": "Knowledge"
    }
]