[
    {
        "name": "Arcane Gate",
        "desc": "<p>You create linked teleportation portals that remain open for the duration. Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. If the portal would open in the space occupied by a creature, the spell fails, and the casting is lost.</p><p>The portals are two-dimensional glowing rings filled with mist, hovering inches from the ground and perpendicular to it at the points you choose. A ring is visible only from one side (your choice), which is the side that functions as a portal.</p><p>Any creature or object entering the portal exits from the other portal as if the two were adjacent to each other; passing through a portal from the nonportal side has no effect. The mist that fills each portal is opaque and blocks vision through it. On your turn, you can rotate the rings as a bonus action so that the active side faces in a different direction.</p>",
        "page": "phb 214",
        "range": "500 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Conjuration",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Circle of Death",
        "desc": "<p>A sphere of negative energy ripples out in a 60-footradius sphere from a point within range. Each creature in that area must make a constitution saving throw. A target takes 8d6 necrotic damage on a failed save, or half as much damage on a successful one.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 7th level or higher, the damage increases by 2d6 for each slot level above 6th.</p>",
        "page": "phb 221",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "The powder of a crushed black pearl worth at least 500 gp.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Necromancy",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Conjure Fey",
        "desc": "<p>You summon a fey creature of challenge rating 6 or lower, or a fey spirit that takes the form of a beast of challenge rating 6 or lower. It appears in an unoccupied space that you can see within range. The fey creature disappears when it drops to 0 hit points or when the spell ends.</p><p>The fey creature is friendly to you and your companions for the duration. Roll initiative for the creature, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you), as long as they don't violate its alignment. If you don’t issue any commands to the fey creature, it defends itself from hostile creatures but otherwise takes no actions.</p><p>If your concentration is broken, the fey creature doesn’t disappear. Instead, you lose control of the fey creature, it becomes hostile toward you and your companions, and it might attack. An uncontrolled fey creature can't be dismissed by you, and it disappears 1 hour after you summoned it.</p><p>The DM has the fey creature’s statistics.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 7th level or higher, the challenge rating increases by 1 for each slot level above 6th.</p>",
        "page": "phb 226",
        "range": "90 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 minute",
        "level": "6th-level",
        "school": "Conjuration",
        "class": "Druid, Warlock"
    },
    {
        "name": "Create Undead",
        "desc": "<p>You can cast this spell only at night. Choose up to three corpses of Medium or Small humanoids within range. Each corpse becomes a ghoul under your control. (The DM has game statistics for these creatures.)</p><p>As a bonus action on each of your turns, you can mentally command any creature you animated with this spell if the creature is within 120 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.</p><p>The creature is under your control for 24 hours, after which it stops obeying any command you have given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature before the current 24-hour period ends. This use of the spell reasserts your control over up to three creatures you have animated with this spell, rather than animating new ones.</p>",
        "higher_level": "<p>When you cast this spell using a 7th-level spell slot, you can animate or reassert control over four ghouls. When you cast this spell using an 8th-level spell slot, you can animate or reassert control over five ghouls or two ghasts or wights. When you cast this spell using a 9th-level spell slot, you can animate or reassert control over six ghouls, three ghasts or wights, or two mummies.</p>",
        "page": "phb 229",
        "range": "10 feet",
        "components": "V, S, M",
        "material": "One clay pot filled with grave dirt, one clay pot filled with brackish water, and one 150 gp black onyx stone for each corpse.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "6th-level",
        "school": "Necromancy",
        "class": "Cleric, Warlock, Wizard"
    },
    {
        "name": "Eyebite",
        "desc": "<p>For the spell’s duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can’t target a creature again if it has succeeded on a saving throw against this casting of eyebite.</p><p><b>Asleep.</b> The target falls unconscious. It wakes up if it takes any damage or if another creature uses its action to shake the sleeper awake.</p><p><b>Panicked.</b> The target is frightened of you. On each of its turns, the frightened creature must take the Dash action and move away from you by the safest and shortest available route, unless there is nowhere to move. If the target moves to a place at least 60 feet away from you where it can no longer see you, this effect ends.</p><p><b>Sickened.</b> The target has disadvantage on attack rolls and ability checks. At the end of each of its turns, it can make another wisdom saving throw. If it succeeds, the effect ends.</p>",
        "page": "phb 238",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Necromancy",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Flesh to Stone",
        "desc": "<p>You attempt to turn one creature that you can see within range into stone. If the target’s body is made of flesh, the creature must make a constitution saving throw. On a failed save, it is restrained as its flesh begins to harden. On a successful save, the creature isn’t affected.</p><p>A creature restrained by this spell must make another constitution saving throw at the end of each of its turns. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to stone and subjected to the petrified condition for the duration. The successes and failures don’t need to be consecutive; keep track of both until the target collects three of a kind.</p><p>If the creature is physically broken while petrified, it suffers from similar deformities if it reverts to its original state.</p><p>If you maintain your concentration on this spell for the entire possible duration, the creature is turned to stone until the effect is removed.</p>",
        "page": "phb 243",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A pinch of lime, water, and earth.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Warlock, Wizard"
    },
    {
        "name": "Investiture of Flame",
        "desc": "<p>Flames race across your body, shedding bright light in a 30-foot radius and dim light for an additional 30 feet for the spell's duration. The flames don't harm you. Until the spell ends, you gain the following benefits:</p><p>- You are immune to fire damage and have resistance to cold damage.</p><p>- Any creature that moves within 5 feet of you for the first time on a turn or ends its turn there takes 1d10 fire damage.</p><p>- You can use your action to create a line of fire 15 feet long and 5 feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 4d8 fire damage on a failed save, or half as much damage on a successful one.</p>",
        "page": "ee pc 19",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Investiture of Ice",
        "desc": "<p>Until the spell ends, ice rimes your body, and you gain the following benefits:</p><p>- You are immune to cold damage and have resistance to fire damage.</p><p>- You can move across difficult terrain created by ice or snow without spending extra movement.</p><p>- The ground in a 10-foot radius around you is icy and is difficult terrain for creatures other than you. The radius moves with you.</p><p>- You can use your action to create a 15-foot cone of freezing wind extending from your outstretched hand in a direction you choose. Each creature in the cone must make a Constitution saving throw. A creature takes 4d6 cold damage on a failed save, or half as much damage on a successful one. A creature that fails its save against this effect has its speed halved until the start of your next turn.</p>",
        "page": "ee pc 19",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Investiture of Stone",
        "desc": "<p>Until the spell ends, bits of rock spread across your body, and you gain the following benefits:</p><p>- You have resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.</p><p>- You can use your action to create a small earthquake on the ground in a 15-foot radius centered on you. Other creatures on that ground must succeed on a Dexterity saving throw or be knocked prone.</p><p>- You can move across difficult terrain made of earth or stone without spending extra movement. You can move through solid earth or stone as if it was air and without destabilizing it, but you can't end your movement there. If you do so, you are ejected to the nearest unoccupied space, this spell ends, and you are stunned until the end of your next turn.</p>",
        "page": "ee pc 19",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Investiture of Wind",
        "desc": "<p>Until the spell ends, wind whirls around you, and you gain the following benefits:</p><p>- Ranged weapon attacks made against you have disadvantage on the attack roll.</p><p>- You gain a flying speed of 60 feet. If you are still flying when the spell ends, you fall, unless you can somehow prevent it.</p><p>- You can use your action to create a 15-foot cube of swirling wind centered on a point you can see within 60 feet of you. Each creature in that area must make a Constitution saving throw. A creature takes 2d10 bludgeoning damage on a failed save, or half as much damage on a successful one. If a Large or smaller creature fails the save, that creature is also pushed up to 10 feet away from the center of the cube.</p>",
        "page": "ee pc 20",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Mass Suggestion",
        "desc": "<p>You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell.</p><p>Each target must make a wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.</p><p>You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a group of soldiers give all their money to the first beggar they meet. If the condition isn’t met before the spell ends, the activity isn’t performed.</p><p>If you or any of your companions damage a creature affected by this spell, the spell ends for that creature.</p>",
        "higher_level": "<p>When you cast this spell using a 7th-level spell slot, the duration is 10 days. When you use an 8th-level spell slot, the duration is 30 days. When you use a 9th-level spell slot, the duration is a year and a day.</p>",
        "page": "phb 258",
        "range": "60 feet",
        "components": "V, M",
        "material": "A snake’s tongue and either a bit of honeycomb or a drop of sweet oil.",
        "ritual": "no",
        "duration": "24 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Permanent Image",
        "desc": "<p>You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts until dispelled. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench).</p><p>As long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.</p><p>Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.</p>",
        "page": "trot spells 36",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A bit of fleece.",
        "ritual": "no",
        "duration": "Until dispelled",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "True Seeing",
        "desc": "<p>This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet.</p>",
        "page": "phb 284",
        "range": "Touch",
        "components": "V, S, M",
        "material": "An ointment for the eyes that costs 25gp; is made from mushroom powder, saffron, and fat; and is consumed by the spell.",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Divination",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard"
    }
]