[
    {
        "name": "Contact Other Plane",
        "desc": "<p>You mentally contact a demigod, the spirit of a long-dead sage, or some other mysterious entity from another plane. Contacting this extraplanar intelligence can strain or even break your mind. When you cast this spell, make a DC 15 intelligence saving throw. On a failure, you take 6d6 psychic damage and are insane until you finish a long rest. While insane, you can’t take actions, can’t understand what other creatures say, can’t read, and speak only in gibberish. A greater restoration spell cast on you ends this effect.</p><p>On a successful save, you can ask the entity up to five questions. You must ask your questions before the spell ends. The DM answers each question with one word, such as “yes,” “no,” “maybe,” “never,” “irrelevant,” or “unclear” (if the entity doesn’t know the answer to the question). If a one-word answer would be misleading, the DM might instead offer a short phrase as an answer.</p>",
        "page": "phb 226",
        "range": "Self",
        "components": "V",
        "ritual": "yes",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "5th-level",
        "school": "Divination",
        "class": "Ritual Caster, Warlock, Wizard"
    },
    {
        "name": "Dominate Person",
        "desc": "<p>You attempt to beguile a humanoid that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.</p><p>While the target is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Attack that creature,” “Run over there,” or “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability.</p><p>You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.</p><p>Each time the target takes damage, it makes a new wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell using a 6th-level spell slot, the duration is concentration, up to 10 minutes. When you use a 7th-level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 8th level or higher, the duration is concentration, up to 8 hours.</p>",
        "page": "phb 235",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery<br/> Warlock: Archfey, Great Old One",
        "domains": "Trickery",
        "patrons": "Archfey, Great Old One"
    },
    {
        "name": "Dream",
        "desc": "<p>This spell shapes a creature’s dreams. Choose a creature known to you as the target of this spell. The target must be on the same plane of existence as you. Creatures that don’t sleep, such as elves, can’t be contacted by this spell. You, or a willing creature you touch, enters a trance state, acting as a messenger.</p><p>While in the trance, the messenger is aware of his or her surroundings, but can’t take actions or move.</p><p>If the target is asleep, the messenger appears in the target’s dreams and can converse with the target as long as it remains asleep, through the duration of the spell. The messenger can also shape the environment of the dream, creating landscapes, objects, and other images. The messenger can emerge from the trance at any time, ending the effect of the spell early. The target recalls the dream perfectly upon waking. If the target is awake when you cast the spell, the messenger knows it, and can either end the trance (and the spell) or wait for the target to fall asleep, at which point the messenger appears in the target’s dreams.</p><p>You can make the messenger appear monstrous and terrifying to the target. If you do, the messenger can deliver a message of no more than ten words and then the target must make a wisdom saving throw. On a failed save, echoes of the phantasmal monstrosity spawn a nightmare that lasts the duration of the target’s sleep and prevents the target from gaining any benefit from that rest. In addition, when the target wakes up, it takes 3d6 psychic damage.</p><p>If you have a body part, lock of hair, clipping from a nail, or similar portion of the target’s body, the target makes its saving throw with disadvantage.</p>",
        "page": "phb 236",
        "range": "Special",
        "components": "V, S, M",
        "material": "A handful of sand, a dab of ink, and a writing quill plucked from a sleeping bird.",
        "ritual": "no",
        "duration": "8 hours",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "5th-level",
        "school": "Illusion",
        "class": "Bard, Druid, Warlock, Wizard",
        "archetype": "Druid: Grassland",
        "circles": "Grassland"
    },
    {
        "name": "Flame Strike",
        "desc": "<p>A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high cylinder centered on a point within range must make a dexterity saving throw. A creature takes 4d6 fire damage and 4d6 radiant damage on a failed save, or half as much damage on a successful one.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 6th level or higher, the fire damage or the radiant damage (your choice) increases by 1d6 for each slot level above 5th.</p>",
        "page": "phb 242",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "Pinch of sulfur.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Evocation",
        "class": "Cleric, Paladin, Warlock",
        "archetype": "Paladin: Devotion<br/> Warlock: Fiend",
        "domains": "Light, War",
        "oaths": "Devotion",
        "patrons": "Fiend"
    },
    {
        "name": "Hallow",
        "desc": "<p>You touch a point and infuse an area around it with holy (or unholy) power. The area can have a radius up to 60 feet, and the spell fails if the radius includes an area already under the effect a hallow spell. The affected area is subject to the following effects.</p><p>First, celestials, elementals, fey, fiends, and undead can’t enter the area, nor can such creatures charm, frighten, or possess creatures within it. Any creature charmed, frightened, or possessed by such a creature is no longer charmed, frightened, or possessed upon entering the area. You can exclude one or more of those types of creatures from this effect.</p><p>Second, you can bind an extra effect to the area. Choose the effect from the following list, or choose an effect offered by the DM. Some of these effects apply to creatures in the area; you can designate whether the effect applies to all creatures, creatures that follow a specific deity or leader, or creatures of a specific sort, such as ores or trolls. When a creature that would be affected enters the spell’s area for the first time on a turn or starts its turn there, it can make a charisma saving throw. On a success, the creature ignores the extra effect until it leaves the area.</p><p><b>Courage.</b> Affected creatures can’t be frightened while in the area.</p><p><b>Darkness.</b> Darkness fills the area. Normal light, as well as magical light created by spells of a lower level than the slot you used to cast this spell, can’t illuminate the area.</p><p><b>Daylight.</b> Bright light fills the area. Magical darkness created by spells of a lower level than the slot you used to cast this spell can’t extinguish the light.</p><p><b>Energy Protection.</b> Affected creatures in the area have resistance to one damage type of your choice, except for bludgeoning, piercing, or slashing.</p><p><b>Energy Vulnerability.</b> Affected creatures in the area have vulnerability to one damage type of your choice, except for bludgeoning, piercing, or slashing.</p><p><b>Everlasting Rest.</b> Dead bodies interred in the area can’t be turned into undead.</p><p><b>Extradimensional Interference.</b> Affected creatures can’t move or travel using teleportation or by extradimensional or interplanar means.</p><p><b>Fear.</b> Affected creatures are frightened while in the area.</p><p><b>Silence.</b> No sound can emanate from within the area, and no sound can reach into it.</p><p><b>Tongues.</b> Affected creatures can communicate with any other creature in the area, even if they don’t share a common language.</p>",
        "page": "phb 249",
        "range": "Touch",
        "components": "V, S, M",
        "material": "Herbs, oils, and incense worth at least 1,000 gp, which the spell consumes.",
        "ritual": "no",
        "duration": "Until dispelled",
        "concentration": "no",
        "casting_time": "24 hours",
        "level": "5th-level",
        "school": "Evocation",
        "class": "Cleric, Warlock",
        "archetype": "Warlock: Fiend",
        "patrons": "Fiend"
    },
    {
        "name": "Hold Monster",
        "desc": "<p>Choose a creature you can see and reach. The target must make a saving throw of Wisdom or be paralyzed for the duration of the spell. This spell has no effect against the undead. At the end of each round, the target can make a new saving throw of Wisdom. If successful, the spell ends for the creature.</p>",
        "higher_level": "<p>When you cast this spell using a level 6 or higher location, you can target an additional creature for each level of location beyond the fifth. The creatures must be within 30 feet o f each other when you target them.</p>",
        "page": "phb 251",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A small piece of iron.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: War<br/> Paladin: Vengeance",
        "domains": "War",
        "oaths": "Vengeance"
    },
    {
        "name": "Scrying",
        "desc": "<p>You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you're casting this spell, it can fail the saving throw voluntarily if it wants to be observed.</p><p><b>Knowledge &amp; Save Modifier</b></p><p>Secondhand (you have heard of the target) +5</p><p>Firsthand (you have met the target) +0</p><p>Familiar (you know the target well) -5</p><p><b>Connection &amp; Save Modifier</b></p><p>Likeness or picture -2</p><p>Possession or garment -4</p><p>Body part, lock of hair, bit of nail, or the like -10</p><p>On a successful save, the target isn’t affected, and you can’t use this spell against it again for 24 hours.</p><p>On a failed save, the spell creates an invisible sensor within 10 feet of the target. You can see and hear through the sensor as if you were there. The sensor moves with the target, remaining within 10 feet of it for the duration. A creature that can see invisible objects sees the sensor as a luminous orb about the size of your fist.</p><p>Instead of targeting a creature, you can choose a location you have seen before as the target of this spell. When you do, the sensor appears at that location and doesn’t move.</p>",
        "page": "phb 273",
        "range": "Self",
        "components": "V, S, M",
        "material": "A focus worth at least 1,000 gp, such as a crystal ball, a silver mirror, or a font filled with holy water.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "10 minutes",
        "level": "5th-level",
        "school": "Divination",
        "class": "Bard, Cleric, Druid, Paladin, Warlock, Wizard",
        "archetype": "Paladin: Vengeance",
        "domains": "Knowledge, Light",
        "circles": "Coast, Swamp",
        "oaths": "Vengeance"
    },
    {
        "name": "Seeming",
        "desc": "<p>This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a charisma saving throw, and if it succeeds, it is unaffected by this spell.</p><p>The spell disguises physical appearance as well as clothing, armor, weapons, and equipment. You can make each creature seem 1 foot shorter or taller and appear thin, fat, or in between. You can't change a target's body type, so you must choose a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The spell lasts for the duration, unless you use your action to dismiss it sooner.</p><p>The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to a creature's outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel the creature's head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.</p><p>A creature can use its action to inspect a target and make an Intelligence (Investigation) check against your spell save DC. If it succeeds, it becomes aware that the target is disguised.</p>",
        "page": "phb 274",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "8 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Archfey",
        "patrons": "Archfey"
    },
    {
        "name": "Telekinesis",
        "desc": "<p>You gain the ability to move or manipulate creatures or objects by thought. When you cast the spell, and as your action each round for the duration, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below. You can affect the same target round after round, or choose a new one at any time. If you switch targets, the prior target is no longer affected by the spell.</p><p><b>Creature.</b> You can try to move a Huge or smaller creature. Make an ability check with your spellcasting ability contested by the creature’s Strength check. If you win the contest, you move the creature up to 30 feet in any direction, including upward but not beyond the range of this spell. Until the end of your next turn, the creature is restrained in your telekinetic grip. A creature lifted upward is suspended in mid-air.</p><p>On subsequent rounds, you can use your action to attempt to maintain your telekinetic grip on the creature by repeating the contest.</p><p><b>Object.</b> You can try to move an object that weighs up to 1,000 pounds. If the object isn’t being worn or carried, you automatically move it up to 30 feet in any direction, but not beyond the range of this spell.</p><p>If the object is worn or carried by a creature, you must make an ability check with your spellcasting ability contested by that creature’s Strength check. If you succeed, you pull the object away from that creature and can move it up to 30 feet in any direction but not beyond the range of this spell.</p><p>You can exert fine control on objects with your telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or retrieving an item from an open container, or pouring the contents from a vial.</p>",
        "page": "phb 280",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Transmutation",
        "class": "Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Great Old One",
        "patrons": "Great Old One"
    }
]