[
    {
        "name": "Banishment",
        "desc": "<p>You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a charisma saving throw or be banished.</p><p>If the target is native to the plane of existence you’re on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied.</p><p>If the target is native to a different plane of existence than the one you’re on, the target is banished with a faint popping noise, returning to its home plane. If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn’t return.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th.</p>",
        "page": "phb 217",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "An item distasteful to the target.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Abjuration",
        "class": "Cleric, Paladin, Sorcerer, Warlock, Wizard",
        "oaths": "Vengeance"
    },
    {
        "name": "Blight",
        "desc": "<p>Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a constitution saving throw. The target takes 8d8 necrotic damage on a failed save, or half as much damage on a successful one. The spell has no effect on undead or constructs.</p><p>If you target a plant creature or a magical plant, it makes the saving throw with disadvantage, and the spell deals maximum damage to it.</p><p>If you target a nonmagical plant that isn’t a creature, such as a tree or shrub, it doesn’t make a saving throw; it simply withers and dies.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 5th level of higher, the damage increases by 1d8 for each slot level above 4th.</p>",
        "page": "phb 219",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Necromancy",
        "class": "Druid, Sorcerer, Warlock, Wizard",
        "circles": "Desert"
    },
    {
        "name": "Dimension Door",
        "desc": "<p>You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as “200 feet straight downward” or “upward to the northwest at a 45-degree angle, 300 feet.”</p><p>You can bring along objects as long as their weight doesn’t exceed what you can carry. You can also bring one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell.</p><p>If you would arrive in a place already occupied by an object or a creature, you and any creature traveling with you each take 4d6 force damage, and the spell fails to teleport you.</p>",
        "page": "phb 233",
        "range": "500 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Conjuration",
        "class": "Bard, Cleric, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery<br/> Paladin: Vengeance",
        "domains": "Trickery",
        "oaths": "Vengeance"
    },
    {
        "name": "Dominate Beast",
        "desc": "<p>You attempt to beguile a creature that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.</p><p>While the creature is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as \"Attack that creature,\" \"Run over there,\" or \"Fetch that object.\" If the creature completes the order and doesn't receive further direction from you, it defends and preserves itself to the best of its ability.</p><p>You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well. Each time the target takes damage, it makes a new wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell with a 9th level spell slot, the duration is concentration, up to 8 hours.</p>",
        "page": "phb 234",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Enchantment",
        "class": "Cleric, Druid, Sorcerer, Warlock",
        "archetype": "Cleric: Nature<br/> Warlock: Archfey, Great Old One",
        "domains": "Nature",
        "patrons": "Archfey, Great Old One"
    },
    {
        "name": "Elemental Bane",
        "desc": "<p>Choose one creature you can see within range, and choose one of the following damage types: acid, cold, fire, lightning, or thunder. The target must succeed on a Constitution saving throw or be affected by the spell for its duration. The first time each turn the affected target takes damage of the chosen type, the target takes an extra 2d6 damage of that type. Moreover, the target loses any resistance to that damage type until the spell ends.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.</p>",
        "page": "ee pc 17",
        "range": "90 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Transmutation",
        "class": "Druid, Warlock, Wizard"
    },
    {
        "name": "Evard's Black Tentacles",
        "desc": "<p>Dark writhing tentacles occupy the ground in a square of 90 feet ridge you can see the range of the spell. For the duration of the spell, the tentacles make the difficult terrain.</p><p>When a creature enters the affected area for the first time in a turn or where it begins its turn, it must make a dexterity saving throw or it suffers 3d6 bludgeoning damage and is hampered by tentacles until the end of the spell. A creature that starts its turn in the area and is already hampered by the tentacles suffers 3d6 bludgeoning damage.</p><p>A creature hampered by the tentacles can use his action to a test Strength or Dexterity (at its option) opposite to the SD backup of your fate. If successful, it is free.</p>",
        "page": "phb 238",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A piece of tentacle of an octopus or a giant squid.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Conjuration",
        "class": "Warlock, Wizard",
        "archetype": "Warlock: Great Old One",
        "patrons": "Great Old One"
    },
    {
        "name": "Fire Shield",
        "desc": "<p>Thin and vaporous flame surround your body for the duration of the spell, radiating a bright light bright light in a 10-foot radius and dim light for an additional 10 feet. You can end the spell using an action to make it disappear.</p><p>The flames are around you a heat shield or cold, your choice. The heat shield gives you cold damage resistance and the cold resistance to fire damage.</p><p>In addition, whenever a creature within 5 feet of you hits you with a melee attack, flames spring from the shield. The attacker then suffers 2d8 points of fire damage or cold, depending on the model. </p>",
        "page": "phb 242",
        "range": "Self",
        "components": "V, S, M",
        "material": "A little phosphorus or a firefly.",
        "ritual": "no",
        "duration": "10 minutes",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Evocation",
        "class": "Warlock, Wizard",
        "archetype": "Warlock: Fiend",
        "patrons": "Fiend"
    },
    {
        "name": "Greater Invisibility",
        "desc": "<p>You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person.</p>",
        "page": "phb 246",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Illusion",
        "class": "Bard, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Underdark<br/> Warlock: Archfey",
        "circles": "Underdark",
        "patrons": "Archfey"
    },
    {
        "name": "Hallucinatory Terrain",
        "desc": "<p>The tactile characteristics of the terrain are unchanged, so creatures entering the area are likely to see through the illusion. If the difference isn’t obvious by touch, a creature carefully examining the illusion can attempt an Intelligence (Investigation) check against your spell save DC to disbelieve it. A creature who discerns the illusion for what it is, sees it as a vague image superimposed on the terrain.</p>",
        "page": "phb 249",
        "range": "300 feet",
        "components": "V, S, M",
        "material": "A stone, a twig, and a bit of green plant.</p><p>You make natural terrain in a 150-foot cube in range look, sound, and smell like some other sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Manufactured structures, equipment, and creatures within the area aren’t changed in appearance.",
        "ritual": "no",
        "duration": "24 hours",
        "concentration": "no",
        "casting_time": "10 minutes",
        "level": "4th-level",
        "school": "Illusion",
        "class": "Bard, Druid, Warlock, Wizard",
        "circles": "Desert"
    },
    {
        "name": "Wall of Fire",
        "desc": "<p>You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.</p><p>When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.</p><p>One side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet o f that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side o f the wall deals no damage.</p><p>The other side of the wall deals no damage.</p>",
        "higher_level": "<p>When you cast this spell using a level spell slot 5 or more, the damage of the spell increases by 1d8 for each level of higher spell slot to 4.</p>",
        "page": "phb 285",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A small piece of phosphorus.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Evocation",
        "class": "Cleric, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Light<br/> Warlock: Fiend",
        "domains": "Light",
        "patrons": "Fiend"
    }
]