[
    {
        "name": "Burning Hands",
        "desc": "<p>As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.</p><p>The fire ignites any flammable objects in the area that aren’t being worn or carried.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.</p>",
        "page": "phb 220",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Evocation",
        "class": "Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Light<br/> Warlock: Fiend",
        "domains": "Light",
        "patrons": "Fiend"
    },
    {
        "name": "Catapult",
        "desc": "<p>Choose one object weighing 1 to 5 pounds within range that isn't being worn or carried. The object flies in a straight line up to 90 feet in a direction you choose before falling to the ground, stopping early if it impacts against a solid surface. If the object would strike a creature, that creature must make a Dexterity saving throw. On a failed save, the object strikes the target and stops moving. In either case, both the object and the creature or solid surface take 3d8 bludgeoning damage.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the maximum weight of objects that you can target with this spell increases by 5 pounds, and the damage increases by 1d8, for each slot level above 1st.</p>",
        "page": "ee pc 15",
        "range": "150 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Transmutation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Chaos Bolt",
        "desc": "<p>You hurl an undulating, warbling mass of chaotic energy at one creature in range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 + 1d6 damage. Choose one of the d8s. The number rolled on that die determines the attack's damage type, as shown below.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, each target takes 1d6 extra damage of the type rolled for each slot level above 1st.</p>",
        "page": "",
        "range": "120 feet",
        "components": "V, S",
        "material": "",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Evocation",
        "class": "Sorcerer"
    },
    {
        "name": "Charm Person",
        "desc": "<p>You attempt to charm a humanoid you can see within range. It must make a wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.</p>",
        "page": "phb 221",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery",
        "domains": "Trickery"
    },
    {
        "name": "Chromatic Orb",
        "desc": "<p>You hurl a 4-inch-diameter sphere of energy at a creature that you can see within range. You choose acid, cold, fire, lightning, poison, or thunder for the type of orb you create, and then make a ranged spell attack against the target. If the attack hits, the creature takes 3d8 of the type you chose.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.</p>",
        "page": "phb 221",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A diamond worth at least 50gp.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Color Spray",
        "desc": "<p>A dazzling array of flashing, colored light springs from your hand. Roll 6d10; the total is how many hit points of creatures this spell can effect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can’t see).</p><p>Starting with the creature that has the lowest current hit points, each creature affected by this spell is blinded until the spell ends. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for that creature to be affected.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d10 for each slot level above 1st.</p>",
        "page": "phb 222",
        "range": "Self",
        "components": "V, S, M",
        "material": "A pinch of powder or sand that is colored red, yellow, and blue.",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Illusion",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Comprehend Languages",
        "desc": "<p>For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text.</p><p>This spell doesn’t decode secret messages in a text or a glyph, such as an arcane sigil, that isn’t part of a written language.</p>",
        "page": "phb 224",
        "range": "Self",
        "components": "V, S, M",
        "material": "A pinch of soot and salt.",
        "ritual": "yes",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Divination",
        "class": "Bard, Ritual Caster, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Detect Magic",
        "desc": "<p>For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.</p><p>The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.</p>",
        "page": "phb 231",
        "range": "Self",
        "components": "V, S",
        "ritual": "yes",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Divination",
        "class": "Bard, Cleric, Druid, Paladin, Ranger, Ritual Caster, Sorcerer, Wizard"
    },
    {
        "name": "Disguise Self",
        "desc": "<p>You make yourself – including your clothing, armor, weapons, and other belongings on your person – look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can’t change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.</p><p>The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.</p><p>To discern that you are disguised, a creature can use its action to inspect your apperance and must succeed on an Intelligence (Investigation) check against your spell save DC.</p>",
        "page": "phb 233",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Illusion",
        "class": "Bard, Cleric, Sorcerer, Wizard",
        "archetype": "Cleric: Trickery",
        "domains": "Trickery"
    },
    {
        "name": "Earth Tremor",
        "desc": "<p>You cause a tremor in the ground in a 10-foot radius. Each creature other than you in that area must make a Dexterity saving throw. On a failed save, a creature takes 1d6 bludgeoning damage and is knocked prone. If the ground in that area is loose earth or stone, it becomes difficult terrain until cleared.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.</p>",
        "page": "ee pc 17",
        "range": "Self (10-foot radius)",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Evocation",
        "class": "Bard, Druid, Sorcerer, Wizard"
    },
    {
        "name": "Expeditious Retreat",
        "desc": "<p>This spell allows you to move at an incredible pace. When you cast this spell, and then as a bonus action on each of your turns until the spell ends, you can take the Dash action.<p>",
        "page": "phb 238",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 bonus action",
        "level": "1st-level",
        "school": "Transmutation",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "False Life",
        "desc": "<p>Bolstering yourself with a necromantic facsimile of life, you gain 1d4 + 4 temporary hit points for the duration.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, you gain 5 additional temporary hit points for each slot level above 1st.</p>",
        "page": "phb 239",
        "range": "Self",
        "components": "V, S, M",
        "material": "A small amount of alcohol or distilled spirits.",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Necromancy",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Feather Fall",
        "desc": "<p>Choose up to five falling creatures within range. A falling creature’s rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature.</p>",
        "page": "phb 239",
        "range": "60 feet",
        "components": "V, M",
        "material": "A small feather or a piece of down.",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 reaction",
        "level": "1st-level",
        "school": "Transmutation",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Fog Cloud",
        "desc": "<p>You create a 20-foot-radius sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the radius of the fog increases by 20 feet for each slot level above 1st.</p>",
        "page": "phb 243",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Conjuration",
        "class": "Cleric, Druid, Ranger, Sorcerer, Wizard",
        "archetype": "Cleric: Tempest",
        "domains": "Tempest"
    },
    {
        "name": "Ice Knife",
        "desc": "<p>You create a shard of ice and fling it at one creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 piercing damage. Hit or miss, the shard then explodes. The target and each creature within 5 feet of the point where the ice exploded must succeed on a Dexterity saving throw or take 2d6 cold damage.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the cold damage increases by 1d6 for each slot level above 1st.</p>",
        "page": "ee pc 19",
        "range": "60 feet",
        "components": "S, M",
        "material": "A drop of water or piece of ice.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Conjuration",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Jump",
        "desc": "<p>You touch a creature. The creature’s jump distance is tripled until the spell ends.</p>",
        "page": "phb 254",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A grasshopper’s hind leg.",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Transmutation",
        "class": "Druid, Ranger, Sorcerer, Wizard"
    },
    {
        "name": "Mage Armor",
        "desc": "<p>You touch a willing creature who isn’t wearing armor, and a protective magical force surrounds it until the spell ends. The target’s base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.</p>",
        "page": "phb 256",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A piece of cured leather.",
        "ritual": "no",
        "duration": "8 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Abjuration",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Magic Missile",
        "desc": "<p>You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st.</p>",
        "page": "phb 257",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Ray of Sickness",
        "desc": "<p>A ray of sickening greenish energy lashes out toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 poison damage and must make a constitution saving throw. On a failed save, it is also poisoned until the end of your next turn.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.</p>",
        "page": "phb 271",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Necromancy",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Shield",
        "desc": "<p>An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.</p>",
        "page": "phb 275",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 reaction",
        "level": "1st-level",
        "school": "Abjuration",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Silent Image",
        "desc": "<p>You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn’t accompanied by sound, smell, or other sensory effects.</p><p>You can use your action to cause the image to move to any spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking.</p><p>Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image.</p>",
        "page": "phb 276",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A bit of fleece.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Sleep",
        "desc": "<p>This spell sends creatures into a magical slumber. Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).</p><p>Starting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for that creature to be affected.</p><p>Undead and creatures immune to being charmed aren’t affected by this spell.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st.</p>",
        "page": "phb 276",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A pinch of fine sand, rose petals, or a cricket.",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Archfey",
        "patrons": "Archfey"
    },
    {
        "name": "Thunderwave",
        "desc": "<p>A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn’t pushed.</p><p>In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell’s effect, and the spell emits a thunderous boom audible out to 300 feet.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.</p>",
        "page": "phb 282",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Evocation",
        "class": "Bard, Cleric, Druid, Sorcerer, Wizard",
        "archetype": "Cleric: Tempest",
        "domains": "Tempest"
    },
    {
        "name": "Witch Bolt",
        "desc": "<p>A beam of crackling, blue energy lances out toward a creature within range, forming a sustained arc of lightning between you and the target. Make a ranged spell attack against that creature. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 1d12 lightning damage to the target automatically. The spell ends if you use your action to do anything else. The spell also ends if the target is ever outside the spell’s range or if it has total cover from you.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d12 for each slot level above 1st.</p>",
        "page": "phb 289",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "A twig from a tree that has been struck by lightning.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "school": "Evocation",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Aganazzar's Scorcher",
        "desc": "<p>A line of roaring flame 30 feet long and 5 feet wide emanates from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 fire damage on a failed save, or half as much damage on a successful one.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3nd level or higher, the damage increases by 1d8 for each slot level above 2st.</p>",
        "page": "ee pc 15",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "A red dragon's scale.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Alter Self",
        "desc": "<p>You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts, you can end one option as an action to gain the benefits of a different one.</p><p><b>Aquatic Adaptation.</b> You adapt your body to an aquatic environment, sprouting gills and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed.</p><p><b>Change Appearance.</b> You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and distinguishing characteristics, if any. You can make yourself appear as a member of another race, though none of your statistics change. You also can’t appear as a creature of a different size than you, and your basic shape stays the same; if you're bipedal, you can’t use this spell to become quadrupedal, for instance. At any time for the duration of the spell, you can use your action to change your appearance in this way again.</p><p><b>Natural Weapons.</b> You grow claws, fangs, spines, horns, or a different natural weapon of your choice. Your unarmed strikes deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient with your unarmed strikes. Finally, the natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it.</p>",
        "page": "phb 211",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Blindness/Deafness",
        "desc": "<p>You can blind or deafen a foe. Choose one creature that you can see within range to make a constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a constitution saving throw. On a success, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.</p>",
        "page": "phb 219",
        "range": "30 feet",
        "components": "V",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Necromancy",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Fiend",
        "patrons": "Fiend"
    },
    {
        "name": "Blur",
        "desc": "<p>Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn’t rely on sight, as with blindsight, or can see through illusions, as with truesight.</p>",
        "page": "phb 219",
        "range": "Self",
        "components": "V",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Illusion",
        "class": "Druid, Sorcerer, Wizard",
        "archetype": "Druid: Desert",
        "circles": "Desert"
    },
    {
        "name": "Cloud of Daggers",
        "desc": "<p>You fill the air with spinning daggers in a cube 5 feet on each side, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell’s area for the first time on a turn or starts its turn there.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d4 for each slot level above 2nd.</p>",
        "page": "phb 222",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A sliver of glass.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Conjuration",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Crown of Madness",
        "desc": "<p>One humanoid of your choice that you can see within range must succeed on a wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes.</p><p>The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose.</p><p>The target can act normally on its turn if you choose no creature or if none are within its reach.</p><p>On your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a wisdom saving throw at the end of each of its turns. On a success, the spell ends.</p>",
        "page": "phb 229",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Darkness",
        "desc": "<p>Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can’t see through this darkness, and nonmagical light can’t illuminate it.</p><p>If the point you choose is on an object you are holding or one that isn’t being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.</p><p>If any of this spell’s area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.</p>",
        "page": "phb 230",
        "range": "60 feet",
        "components": "V, M",
        "material": "Bat fur and a drop of pitch or piece of coal.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Swamp",
        "circles": "Swamp"
    },
    {
        "name": "Darkvision",
        "desc": "<p>You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet.</p>",
        "page": "phb 230",
        "range": "Touch",
        "components": "V, S, M",
        "material": "Either a pinch of dried carrot or an agate.",
        "ritual": "no",
        "duration": "8 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Druid, Ranger, Sorcerer, Wizard"
    },
    {
        "name": "Detect Thoughts",
        "desc": "<p>For the duration of the spell, you can read the thoughts of some creatures. While casting the spell and at your action in each round until the spell, you may focus your mind on a creature you can see 30 feet of you. If the chosen creature has an Intelligence of 3 or less, or if she does not speak any language, the creature is not affected.</p><p>You first read the surface thoughts of the creature, which occupies her mind at that moment. In an action, you can direct your attention to the thoughts of another creature or attempt to deepen your reading thoughts of the same creature. If you deepen your reading, the target must make a backup of Wisdom, otherwise you get access to his argument (if any), in his emotional state and thought that concerns his mind on a broader spectrum Such a concern, love or hate. If successful, the spell ends. In all cases, the target is aware that his mind is under your eyes. Unless you are directing your attention to the thoughts of another creature, the target can use his action turn to roll Intelligence opposite your roll Intelligence. If she has the upper hand, the spell ends.</p><p>The questions verbally directed to the target guide the train of thought. This spell is especially effective during an interrogation.</p><p>You can also use this spell to detect the presence of thinking creatures that are invisible to you. When you cast this spell, or in an action for the duration of the spell, you can find thoughts to 30 feet of you. The spell can override most obstacles but it is blocked by 2 feet stone 2 inches of precious metal, or a thin sheet of lead. You can not detect a creature with an Intelligence of 3 or less or speaking any language.</p><p>After detecting the presence of a creature in this way, you can read his thoughts for the rest of the spell's duration as described above, even if you can not see it, but only if it remains in the range of the spell.</p>",
        "page": "phb 231",
        "range": "Self",
        "components": "V, S, M",
        "material": "A copper coin.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Divination",
        "class": "Bard, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Great Old One",
        "patrons": "Great Old One"
    },
    {
        "name": "Dust Devil",
        "desc": "<p>Choose an unoccupied 5-foot cube of air that you can see within range. An elemental force that resembles a dust devil appears in the cube and lasts for the spell's duration.</p><p>Any creature that ends its turn within 5 feet of the dust devil must make a Strength saving throw. On a failed save, the creature takes 1d8 bludgeoning damage and is pushed 10 feet away. On a successful save, the creature takes half as much damage and isn't pushed.</p><p>As a bonus action, you can move the dust devil up to 30 feet in any direction. If the dust devil moves over sand, dust, loose dirt, or small gravel, it sucks up the material and forms a 10-foot-radius cloud of debris around itself that lasts until the start of your next turn. The cloud heavily obscures its area.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.</p>",
        "page": "ee pc 17",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A pinch of dust.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Conjuration",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Earthbind",
        "desc": "<p>Choose one creature you can see within range. Yellow strips of magical energy loop around the creature. The target must succeed on a Strength saving throw or its flying speed (if any) is reduced to 0 feet for the spell's duration. An airborne creature affected by this spell descends at 60 feet per round until it reaches the ground or the spell ends.</p>",
        "page": "ee pc 17",
        "range": "300 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Enhance Ability",
        "desc": "<p>You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends.</p><p><b>Bear’s Endurance.</b> The target has advantage on constitution checks. It also gains 2d6 temporary hit points, which are lost when the spell ends. </p><p><b>Bull’s Strength.</b> The target has advantage on strength checks, and his or her carrying capacity doubles.</p><p><b>Cat’s Grace.</b> The target has advantage on dexterity checks. It also doesn’t take damage from falling 20 feet or less if it isn’t incapacitated.</p><p><b>Eagle’s Splendor.</b> The target has advantage on Charisma checks.</p><p><b>Fox’s Cunning.</b> The target has advantage on intelligence checks.</p><p><b>Owl’s Wisdom.</b> The target has advantage on wisdom checks.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.</p>",
        "page": "phb 237",
        "range": "Touch",
        "components": "V, S, M",
        "material": "Fur or a feather from a beast.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Bard, Cleric, Druid, Sorcerer"
    },
    {
        "name": "Enlarge/Reduce",
        "desc": "<p>Enlarging or reducing in size a creature or object that you can see and is within range for the duration of the spell. Choose a creature or object that is not worn or carried. If the target does not consent, it can make a constitution saving throw. If successful, the spell has no effect.</p><p>If the target is a creature, everything she wears and carries with it change size. Any item dropped by the affected creature returns to its normal size.</p><p><b>Magnification.</b> The double target in all dimensions, and its weight is multiplied by eight. This increases the size of a class of M to G for example. If there is not enough space in the room for the double target size, the creature or object reaches the maximum size possible in the available space. Until the end of the spell, the target also has the advantage of its jets Force and Force saves. Weapons to the target also grow. As long as these weapons are enlarged, the target's attacks cause additional 1d4 damage.</p><p><b>Reduction.</b> The size of the target is reduced by half in all dimensions, and its weight is divided by eight. This reduction decreases the size of a class from M to P for example. Until the end of the spell, the target has a disadvantage to its jets Force and its Force saves. The weapons of the target shrink too. As long as these weapons are reduced, target attacks cause less damage 1d4 (minimum 1 point of damage).</p> ",
        "page": "phb 237",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "A pinch iron powder.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Gust of Wind",
        "desc": "<p>A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a strength saving throw or be pushed 15 feet away from you in a direction following the line.</p><p>Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you.</p><p>The gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them.</p><p>As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you.</p>",
        "page": "phb 248",
        "range": "Self",
        "components": "V, S, M",
        "material": "A legume seed.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Cleric, Druid, Sorcerer, Wizard",
        "archetype": "Cleric: Tempest",
        "domains": "Tempest"
    },
    {
        "name": "Hold Person",
        "desc": "<p>Choose a humanoid that you can see within range. The target must succeed on a wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another wisdom saving throw. On a success, the spell ends on the target.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them.</p>",
        "page": "phb 251",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A small, straight piece of iron.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Druid, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Paladin: Vengeance",
        "circles": "Arctic",
        "oaths": "Vengeance"
    },
    {
        "name": "Invisibility",
        "desc": "<p>A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person. The spell ends for a target that attacks or casts a spell.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.</p>",
        "page": "phb 254",
        "range": "Touch",
        "components": "V, S, M",
        "material": "An eyelash encased in gum arabic.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Illusion",
        "class": "Bard, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Grassland",
        "circles": "Grassland"
    },
    {
        "name": "Knock",
        "desc": "<p>Choose an object that you can see within range. The object can be a door, a box, a chest, a set of manacles, a padlock, or another object that contains a mundane or magical means that prevents access.</p><p>A target that is held shut by a mundane lock or that is stuck or barred becomes unlocked, unstuck, or unbarred. If the object has multiple locks, only one of them is unlocked.</p><p>If you choose a target that is held shut with arcane lock, that spell is suppressed for 10 minutes, during which time the target can be opened and shut normally.</p><p>When you cast the spell, a loud knock, audible from as far away as 300 feet, emanates from the target object.</p>",
        "page": "phb 254",
        "range": "60 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Levitate",
        "desc": "<p>One creature or object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. An unwilling creature that succeeds on a constitution saving throw is unaffected.</p><p>The target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target’s altitude by up to 20 feet in either direction on your turn. If you are the target, you can move up or down as part of your move. Otherwise, you can use your action to move the target, which must remain within the spell’s range.</p><p>When the spell ends, the target floats gently to the ground if it is still aloft.</p>",
        "page": "phb 255",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "Either a small leather loop or a piece of golden wire bent into a cup shape with a long shank on one end.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Maximilian's Earthen Grasp",
        "desc": "<p>You choose a 5-foot-square unoccupied space on the ground that you can see within range. A Medium hand made from compacted soil rises there and reaches for one creature you can see within 5 feet of it. The target must make a Strength saving throw. On a failed save, the target takes 2d6 bludgeoning damage and is restrained for the spell's duration.</p><p>As an action, you can cause the hand to crush the restrained target, who must make a Strength saving throw. It takes 2d6 bludgeoning damage on a failed save, or half as much damage on a successful one. To break out, the restrained target can make a Strength check against your spell save DC. On a success, the target escapes and is no longer restrained by the hand.</p><p>As an action, you can cause the hand to reach for a different creature or to move to a different unoccupied space within range. The hand releases a restrained target if you do either.</p>",
        "page": "ee pc 20",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "A miniature hand sculpted from clay.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Mirror Image",
        "desc": "<p>Three illusionary duplicates of yourself appear in your space. Until the end of the spell, duplicates move with you and imitate your actions, swapping their position so that it is impossible to determine which image is real. You can use your action to dispel the illusory duplicates.</p><p>Whenever a creature is targeting you with an attack during the duration of the spell, roll 1d20 to determine if the attack does not target rather one of your duplicates.</p><p>If you have three duplicates, you need 6 or more on your throw to lead the target of the attack to a duplicate. With two duplicates, you need 8 or more. With one duplicate, you need 11 or more.</p><p>The CA of a duplicate is 10 + your Dexterity modifier. If an attack hits a duplicate, it is destroyed. A duplicate may be destroyed not just an attack on key. It ignores other damage and effects. The spell ends if the three duplicates are destroyed.</p><p>A creature is unaffected by this fate if she can not see if it relies on a different meaning as vision, such as blind vision, or if it can perceive illusions as false, as with clear vision.</p>",
        "page": "phb 260",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Illusion",
        "class": "Cleric, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery<br/> Druid: Coast",
        "domains": "Trickery",
        "circles": "Coast"
    },
    {
        "name": "Misty Step",
        "desc": "<p>Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.</p>",
        "page": "phb 260",
        "range": "Self",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 bonus action",
        "level": "2nd-level",
        "school": "Conjuration",
        "class": "Druid, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Coast<br/> Paladin: Ancients, Vengeance",
        "circles": "Coast",
        "oaths": "Ancients, Vengeance"
    },
    {
        "name": "Phantasmal Force",
        "desc": "<p>You craft an illusion that takes root in the mind of a creature that you can see within range. The target must make an intelligence saving throw. On a failed save, you create a phantasmal object, creature, or other visible phenomenon of your choice that is no larger than a 10-foot cube and that is perceivable only to the target for the duration. This spell has no effect on undead or constructs.</p><p>The phantasm includes sound, temperature, and other stimuli, also evident only to the creature.</p><p>The target can use its action to examine the phantasm with an Intelligence (Investigation) check against your spell save DC. If the check succeeds, the target realizes that the phantasm is an illusion, and the spell ends.</p><p>While a target is affected by the spell, the target treats the phantasm as if it were real. The target rationalizes any illogical outcomes from interacting with the phantasm. For example, a target attempting to walk across a phantasmal bridge that spans a chasm falls once it steps onto the bridge. If the target survives the fall, it still believes that the bridge exists and comes up with some other explanation for its fall—it was pushed, it slipped, or a strong wind might have knocked it off.</p><p>An affected target is so convinced of the phantasm's reality that it can even take damage from the illusion. A phantasm created to appear as a creature can attack the target. Similarly, a phantasm created to appear as fire, a pool of acid, or lava can burn the target. Each round on your turn, the phantasm can deal 1d6 psychic damage to the target if it is in the phantasm's area or within 5 feet of the phantasm, provided that the illusion is of a creature or hazard that could logically deal damage, such as by attacking. The target perceives the damage as a type appropriate to the illusion.</p>",
        "page": "phb 264",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A bit of fleece.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Archfey, Great Old One",
        "patrons": "Archfey, Great Old One"
    },
    {
        "name": "Pyrotechnics",
        "desc": "<p>Choose an area of flame that you can see and that can fit within a 5-foot cube within range. You can extinguish the fire in that area, and you create either fireworks or smoke.</p><p>Fireworks. The target explodes with a dazzling display of colors. Each creature within 10 feet of the target must succeed on a Constitution saving throw or become blinded until the end of your next turn.</p><p>Smoke. Thick black smoke spreads out from the target in a 20-foot radius, moving around corners. The area of the smoke is heavily obscured. The smoke persists for 1 minute or until a strong wind disperses it.</p>",
        "page": "ee pc 21",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Scorching Ray",
        "desc": "<p>You generate three rays of fire and will throw to targets in the range of the spell. You can project them on one or more targets.</p><p>Perform a remote attack spell for each department. If it hits, the target takes 2d6 fire damage.</p>",
        "higher_level": "<p>When you cast this spell using a 3 or higher level spell slot, you generate an additional radius for each level of higher spell slot 2.</p>",
        "page": "phb 273",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Light<br/> Warlock: Fiend",
        "domains": "Light",
        "patrons": "Fiend"
    },
    {
        "name": "See Invisibility",
        "desc": "<p>For the duration of the spell, you see invisible creatures and objects as if they were visible, and you can see through Ethereal. The ethereal objects and creatures appear ghostly translucent.</p>",
        "page": "phb 274",
        "range": "Self",
        "components": "V, S, M",
        "material": "A dash of talc and a small amount of silver powder.",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Divination",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Shatter",
        "desc": "<p>A strong resonant sound painfully intense sounds of a desired point in the range of the spell. Each creature has a sphere with a 10-foot-radius sphere centered on that point must make a constitution saving throw or it suffers 3d8 thunder damage. If successful, the damage is halved. A creature made of inorganic materials such as stone, crystal or metal, makes its saving throw with a disadvantage.</p><p>A non-magical item that is not worn or carried also suffers damage if it is in the area of ​​the spell.</p>",
        "higher_level": "<p>When you cast this spell using a 3 or higher level spell slot, the damage of the spell increases by 1d8 for each level of higher spell slot 2.</p>",
        "page": "phb 275",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A burst of mica.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Tempest",
        "domains": "Tempest"
    },
    {
        "name": "Snilloc's Snowball Swarm",
        "desc": "<p>A flurry of magic snowballs erupts from a point you choose within range. Each creature in a 5-foot-radius sphere centered on that point must make a Dexterity saving throw. A creature takes 3d6 cold damage on a failed save, or half as much damage on a successful one.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.</p>",
        "page": "ee pc 22",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A piece of ice or a small white rock chip.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Spider Climb",
        "desc": "<p>Until the spell ends, one willing creature you touch gains the ability to move up, down, and across vertical surfaces and upside down along ceilings, while leaving its hands free. The target also gains a climbing speed equal to its walking speed.</p>",
        "page": "phb 277",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A drop of bitumen and a spider.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Forest, Mountain, Underdark",
        "circles": "Forest, Mountain, Underdark"
    },
    {
        "name": "Suggestion",
        "desc": "<p>You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.</p><p>The target must make a wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.</p><p>You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn’t met before the spell expires, the activity isn’t performed.</p><p>If you or any of your companions damage the target, the spell ends.</p>",
        "page": "phb 279",
        "range": "30 feet",
        "components": "V, M",
        "material": "A snake’s tongue and either a bit of honeycomb or a drop of sweet oil.",
        "ritual": "no",
        "duration": "Up to 8 hours",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Knowledge",
        "domains": "Knowledge"
    },
    {
        "name": "Warding Wind",
        "desc": "<p>A strong wind (20 miles per hour) blows around you in a 10-foot radius and moves with you, remaining centered on you. The wind lasts for the spell's duration. The wind has the following effects:</p><p>- It deafens you and other creatures in its area.</p><p>- It extinguishes unprotected flames in its area that are torch-sized or smaller.</p><p>- The area is difficult terrain for creatures other than you.</p><p>- The attack rolls of ranged weapon attacks have disadvantage if they pass in or out of the wind.</p><p>- It hedges out vapor, gas, and fog that can be dispersed by strong wind.</p>",
        "page": "ee pc 23",
        "range": "Self",
        "components": "V",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Evocation",
        "class": "Bard, Druid, Sorcerer"
    },
    {
        "name": "Web",
        "desc": "<p>You conjure a mass of thick, sticky webbing at a point of your choice within range. The webs fill a 20-foot cube from that point for the duration. The webs are difficult terrain and lightly obscure their area.</p><p>If the webs aren’t anchored between two solid masses (such as walls or trees) or layered across a floor, wall, or ceiling, the conjured web collapses on itself, and the spell ends at the start of your next turn. Webs layered over a flat surface have a depth of 5 feet.</p><p>Each creature that starts its turn in the webs or that enters them during its turn must make a dexterity saving throw. On a failed save, the creature is restrained as long as it remains in the webs or until it breaks free.</p><p>A creature restrained by the webs can use its action to make a Strength check against your spell save DC. If it succeeds, it is no longer restrained.</p><p>The webs are flammable. Any 5-foot cube of webs exposed to fire burns away in 1 round, dealing 2d4 fire damage to any creature that starts its turn in the fire.</p>",
        "page": "phb 287",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A bit of spiderweb.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "school": "Conjuration",
        "class": "Druid, Sorcerer, Wizard",
        "archetype": "Druid: Underdark",
        "circles": "Underdark"
    },
    {
        "name": "Blink",
        "desc": "<p>Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane). At the start of your next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that range, you appear in the nearest unoccupied space (chosen at random if more than one space is equally near). You can dismiss this spell as an action.</p><p>While on the Ethereal Plane, you can see and hear the plane you originated from, which is cast in shades of gray, and you can’t see anything there more than 60 feet away. You can only affect and be affected by other creatures on the Ethereal Plane. Creatures that aren’t there can’t perceive you or interact with you, unless they have the ability to do so.</p>",
        "page": "phb 219",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery<br/> Warlock: Archfey",
        "domains": "Trickery",
        "patrons": "Archfey"
    },
    {
        "name": "Clairvoyance",
        "desc": "<p>You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can’t be attacked or otherwise interacted with.</p><p>When you cast the spell, you choose seeing or hearing. You can use the chosen sense through the sensor as if you were in its space. As your action, you can switch between seeing and hearing.</p><p>A creature that can see the sensor (such as a creature benefiting from see invisibility or truesight) sees a luminous, intangible orb about the size of your fist.</p>",
        "page": "phb 222",
        "range": "1 mile",
        "components": "V, S, M",
        "material": "A focus worth at least 100gp, either a jeweled horn for hearing or a glass eye for seeing.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "10 minutes",
        "level": "3rd-level",
        "school": "Divination",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Great Old One",
        "patrons": "Great Old One"
    },
    {
        "name": "Counterspell",
        "desc": "<p>You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.</p>",
        "page": "phb 228",
        "range": "60 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 reaction",
        "level": "3rd-level",
        "school": "Abjuration",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Daylight",
        "desc": "<p>A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet.</p><p>If you chose a point on an object you are holding or one that isn’t being worn or carried, the light shines from the object and moves with it. Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the light.</p><p>If any of this spell’s area overlaps with an area of darkness created by a spell of 3rd level or lower, the spell that created the darkness is dispelled.</p>",
        "page": "phb 230",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Evocation",
        "class": "Cleric, Druid, Paladin, Ranger, Sorcerer",
        "domains": "Light",
        "circles": "Grassland"
    },
    {
        "name": "Dispel Magic",
        "desc": "<p>Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a successful check, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell’s level is equal to or less than the level of the spell slot you used.</p>",
        "page": "phb 234",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Abjuration",
        "class": "Bard, Cleric, Druid, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery",
        "domains": "Trickery",
        "oaths": "Devotion"
    },
    {
        "name": "Erupting Earth",
        "desc": "<p>Choose a point you can see on the ground within range. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 bludgeoning damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared away. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d12 for each slot level above 2nd.</p>",
        "page": "ee pc 17",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A piece of obsidian.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Fear",
        "desc": "<p>You project a phantasmal image of a creature’s worst fears. Each creature in a 30-foot cone must succeed on a wisdom saving throw or drop whatever it is holding and become frightened for the duration.</p><p>While frightened by this spell, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn’t have line of sight to you, the creature can make a wisdom saving throw. On a successful save, the spell ends for that creature.</p>",
        "page": "phb 239",
        "range": "Self",
        "components": "V, S, M",
        "material": "A white feather or the heart of a hen.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Fireball",
        "desc": "<p>A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.</p><p>The fire spreads around corners. It ignites flammable objects in the area that aren’t being worn or carried.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.</p>",
        "page": "phb 241",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "A tiny ball of bat guano and sulfur.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Evocation",
        "class": "Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Light<br/> Warlock: Fiend",
        "domains": "Light",
        "patrons": "Fiend"
    },
    {
        "name": "Flame Arrows",
        "desc": "<p>You touch a quiver containing arrows or bolts. When a target is hit by a ranged weapon attack using a piece of ammunition drawn from the quiver, the target takes an extra 1d6 fire damage. The spell's magic ends on the piece of ammunition when it hits or misses, and the spell ends when twelve pieces of ammunition have been drawn from the quiver.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the number of pieces of ammunition you can affect with this spell increases by two for each slot level above 3rd.</p>",
        "page": "ee pc 18",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Druid, Ranger, Sorcerer, Wizard"
    },
    {
        "name": "Fly",
        "desc": "<p>You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.</p>",
        "page": "phb 243",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A wing feather from any bird.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Gaseous Form",
        "desc": "<p>You transform a willing creature you touch, along with everything it’s wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn’t affected.</p><p>While in this form, the target’s only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and constitution saving throws. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can’t fall and remains hovering in the air even when stunned or otherwise incapacitated.</p><p>While in the form of a misty cloud, the target can’t talk or manipulate objects, and any objects it was carrying or holding can’t be dropped, used, or otherwise interacted with. The target can’t attack or cast spells.</p>",
        "page": "phb 244",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A bit of gauze and a wisp of smoke.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Underdark",
        "circles": "Underdark"
    },
    {
        "name": "Haste",
        "desc": "<p>Choose a willing creature that you can see within range. Until the spell ends, the target’s speed is doubled, it gains a +2 bonus to AC, it has advantage on dexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.</p><p>When the spell ends, the target can’t move or take actions until after its next turn, as a wave of lethargy sweeps over it.</p>",
        "page": "phb 250",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "A shaving of licorice root.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Druid, Paladin, Sorcerer, Wizard",
        "archetype": "Druid: Grassland<br/> Paladin: Vengeance",
        "circles": "Grassland",
        "oaths": "Vengeance"
    },
    {
        "name": "Hypnotic Pattern",
        "desc": "<p>You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0.</p><p>The spell ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor.</p>",
        "page": "phb 252",
        "range": "120 feet",
        "components": "S, M",
        "material": "A glowing stick of incense or a crystal vial filled with phosphorescent material.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Lightning Bolt",
        "desc": "<p>A stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a dexterity saving throw. A creature takes 8d6 lightning damage on a failed save, or half as much damage on a successful one.</p><p>The lightning ignites flammable objects in the area that aren’t being worn or carried.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.</p>",
        "page": "phb 255",
        "range": "Self",
        "components": "V, S, M",
        "material": "A bit of fur and a rod of amber, crystal, or glass.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Wizard",
        "archetype": "Druid: Mountain",
        "circles": "Mountain"
    },
    {
        "name": "Major Image",
        "desc": "<p>You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench).</p><p>As long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.</p><p>Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 6th level or higher, the spell lasts until dispelled, without requiring your concentration.</p>",
        "page": "phb 258",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A bit of fleece.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Melf's Minute Meteors",
        "desc": "<p>You create six tiny meteors in your space. They float in the air and orbit you for the spell's duration. When you cast the spell - and as a bonus action on each of your turns thereafter-you can expend one or two of the meteors, sending them streaking toward a point or points you choose within 120 feet of you. Once a meteor reaches its destination or impacts against a solid surface, the meteor explodes. Each creature within 5 feet of the point where the meteor explodes must make a Dexterity saving throw. A creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 4th level or higher, the number of meteors created increases by two for each slot level above 3rd.</p>",
        "page": "ee pc 20",
        "range": "Self",
        "components": "V, S, M",
        "material": "Niter, sulfur, and pine tar formed into a bead.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Protection from Energy",
        "desc": "<p>For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.</p>",
        "page": "phb 270",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Abjuration",
        "class": "Cleric, Druid, Paladin, Ranger, Sorcerer, Wizard",
        "archetype": "Paladin: Ancients, Vengeance",
        "circles": "Desert",
        "oaths": "Ancients, Vengeance"
    },
    {
        "name": "Sleet Storm",
        "desc": "<p>Until the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused.</p><p>The ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell’s area for the first time on a turn or starts its turn there, it must make a dexterity saving throw. On a failed save, it falls prone.</p><p>If a creature is concentrating in the spell’s area, the creature must make a successful constitution saving throw against your spell save DC or lose concentration.</p>",
        "page": "phb 276",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "A pinch of dust and a few drops of water.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Conjuration",
        "class": "Cleric, Druid, Sorcerer, Wizard",
        "archetype": "Cleric: Tempest",
        "domains": "Tempest",
        "circles": "Arctic"
    },
    {
        "name": "Slow",
        "desc": "<p>You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a wisdom saving throw or be affected by this spell for the duration.</p><p>An affected target’s speed is halved, it takes a -2 penalty to AC and dexterity saving throws, and it can’t use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature’s abilities or magic items, it can’t make more than one melee or ranged attack during its turn.</p><p>If the creature attempts to cast a spell with a casting time of 1 action, roll a d20. On an 11 or higher, the spell doesn’t take effect until the creature’s next turn, and the creature must use its action on that turn to complete the spell. If it can’t, the spell is wasted.</p><p>A creature affected by this spell makes another wisdom saving throw at the end of its turn. On a successful save, the effect ends for it.</p>",
        "page": "phb 277",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A drop of molasses.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard",
        "archetype": "Druid: Arctic",
        "circles": "Arctic"
    },
    {
        "name": "Stinking Cloud",
        "desc": "<p>You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.</p><p>Each creature that is completely within the cloud at the start of its turn must make a constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don’t need to breathe or are immune to poison automatically succeed on this saving throw.</p><p>A moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round.</p>",
        "page": "phb 278",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A rotten egg or several skunk cabbage leaves.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Conjuration",
        "class": "Bard, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Swamp, Underdark<br/> Warlock: Fiend",
        "circles": "Swamp, Underdark",
        "patrons": "Fiend"
    },
    {
        "name": "Tongues",
        "desc": "<p>This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.</p>",
        "page": "phb 283",
        "range": "Touch",
        "components": "V, M",
        "material": "A small clay model of a ziggurat.",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Divination",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Wall of Water",
        "desc": "<p>You conjure up a wall of water on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or you can make a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall vanishes when the spell ends. The wall's space is difficult terrain.</p><p>Any ranged weapon attack that enters the wall's space has disadvantage on the attack roll, and fire damage is halved if the fire effect passes through the wall to reach its target. Spells that deal cold damage that pass through the wall cause the area of the wall they pass through to freeze solid (at least a 5-foot square section is frozen). Each 5-foot-square frozen section has AC 5 and 15 hit points. Reducing a frozen section to 0 hit points destroys it. When a section is destroyed, the wall's water doesn't fill it.</p>",
        "page": "ee pc 23",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A drop of water.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Water Breathing",
        "desc": "<p>This spell gives a maximum of ten willing creatures within range and you can see, the ability to breathe underwater until the end of its term. Affected creatures also retain their normal breathing pattern.</p>",
        "page": "phb 287",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "A short piece of reed or straw.",
        "ritual": "yes",
        "duration": "24 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Druid, Ranger, Ritual Caster, Sorcerer, Wizard",
        "circles": "Coast"
    },
    {
        "name": "Water Walk",
        "desc": "<p>This spell grants the ability to move across any liquid surface—such as water, acid, mud, snow, quicksand, or lava—as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration.</p><p>If you target a creature submerged in a liquid, the spell carries the target to the surface of the liquid at a rate of 60 feet per round.</p>",
        "page": "phb 287",
        "range": "30 feet",
        "components": "V, S, M",
        "ritual": "yes",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "school": "Transmutation",
        "class": "Cleric, Druid, Ranger, Ritual Caster, Sorcerer",
        "circles": "Coast, Swamp"
    },
    {
        "name": "Banishment",
        "desc": "<p>You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a charisma saving throw or be banished.</p><p>If the target is native to the plane of existence you’re on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied.</p><p>If the target is native to a different plane of existence than the one you’re on, the target is banished with a faint popping noise, returning to its home plane. If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn’t return.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th.</p>",
        "page": "phb 217",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "An item distasteful to the target.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Abjuration",
        "class": "Cleric, Paladin, Sorcerer, Warlock, Wizard",
        "oaths": "Vengeance"
    },
    {
        "name": "Blight",
        "desc": "<p>Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a constitution saving throw. The target takes 8d8 necrotic damage on a failed save, or half as much damage on a successful one. The spell has no effect on undead or constructs.</p><p>If you target a plant creature or a magical plant, it makes the saving throw with disadvantage, and the spell deals maximum damage to it.</p><p>If you target a nonmagical plant that isn’t a creature, such as a tree or shrub, it doesn’t make a saving throw; it simply withers and dies.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 5th level of higher, the damage increases by 1d8 for each slot level above 4th.</p>",
        "page": "phb 219",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Necromancy",
        "class": "Druid, Sorcerer, Warlock, Wizard",
        "circles": "Desert"
    },
    {
        "name": "Confusion",
        "desc": "<p>This spell assails and distorts the minds of creatures, generating illusions and causing uncontrolled actions. Each creature in a sphere of 10-foot-radius centered on a point chosen in the range of the spell must make a wisdom saving throw otherwise it will be affected by the spell.</p><p>An affected target can react and it must start at the beginning of 1d10 each of his game rounds to determine its behavior for that round.</p><p>At the end of each turn, an affected creature can make a saving throw of Wisdom. If successful, the effect of the spell ends for this target.</p>",
        "higher_level": "<p>When you cast this spell using a level spell slot 5 or more, the radius of the sphere increases by 5 feet for each level of higher spell slot to 4.</p>",
        "page": "phb 224",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "Three walnut shells.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Druid, Sorcerer, Wizard",
        "archetype": "Cleric: Knowledge",
        "domains": "Knowledge"
    },
    {
        "name": "Dimension Door",
        "desc": "<p>You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as “200 feet straight downward” or “upward to the northwest at a 45-degree angle, 300 feet.”</p><p>You can bring along objects as long as their weight doesn’t exceed what you can carry. You can also bring one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell.</p><p>If you would arrive in a place already occupied by an object or a creature, you and any creature traveling with you each take 4d6 force damage, and the spell fails to teleport you.</p>",
        "page": "phb 233",
        "range": "500 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Conjuration",
        "class": "Bard, Cleric, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery<br/> Paladin: Vengeance",
        "domains": "Trickery",
        "oaths": "Vengeance"
    },
    {
        "name": "Dominate Beast",
        "desc": "<p>You attempt to beguile a creature that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.</p><p>While the creature is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as \"Attack that creature,\" \"Run over there,\" or \"Fetch that object.\" If the creature completes the order and doesn't receive further direction from you, it defends and preserves itself to the best of its ability.</p><p>You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well. Each time the target takes damage, it makes a new wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell with a 9th level spell slot, the duration is concentration, up to 8 hours.</p>",
        "page": "phb 234",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Enchantment",
        "class": "Cleric, Druid, Sorcerer, Warlock",
        "archetype": "Cleric: Nature<br/> Warlock: Archfey, Great Old One",
        "domains": "Nature",
        "patrons": "Archfey, Great Old One"
    },
    {
        "name": "Greater Invisibility",
        "desc": "<p>You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person.</p>",
        "page": "phb 246",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Illusion",
        "class": "Bard, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Druid: Underdark<br/> Warlock: Archfey",
        "circles": "Underdark",
        "patrons": "Archfey"
    },
    {
        "name": "Ice Storm",
        "desc": "<p>A hail of rock-hard ice pounds to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range. Each creature in the cylinder must make a dexterity saving throw. A creature takes 2d8 bludgeoning damage and 4d6 cold damage on a failed save, or half as much damage on a successful one.</p><p>Hailstones turn the storm’s area of effect into difficult terrain until the end of your next turn.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 5th level or higher, the bludgeoning damage increases by 1d8 for each slot level above 4th.</p>",
        "page": "phb 252",
        "range": "300 feet",
        "components": "V, S, M",
        "material": "A pinch of dust and a few drops of water.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Evocation",
        "class": "Cleric, Druid, Paladin, Sorcerer, Wizard",
        "archetype": "Cleric: Tempest<br/> Paladin: Ancients",
        "domains": "Tempest",
        "circles": "Arctic",
        "oaths": "Ancients"
    },
    {
        "name": "Polymorph",
        "desc": "<p>This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a wisdom saving throw to avoid the effect. A shapechanger automatically succeeds on this saving throw.</p><p>The transformation lasts for the duration, or until the target drops to 0 hit points or dies. The new form can be any beast whose challenge rating is equal to or less than the target’s (or the target’s level, if it doesn't have a challenge rating). The target’s game statistics, including mental ability scores, are replaced by the statistics of the chosen beast. It retains its alignment and personality.</p><p>The target assumes the hit points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn’t reduce the creature’s normal form to 0 hit points, it isn’t knocked unconscious.</p><p>The creature is limited in the actions it can perform by the nature of its new form, and it can’t speak, cast spells, or take any other action that requires hands or speech.</p><p>The target’s gear melds into the new form. The creature can’t activate, use, wield, or otherwise benefit from any of its equipment.</p>",
        "page": "phb 266",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A caterpillar cocoon.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Transmutation",
        "class": "Bard, Cleric, Druid, Sorcerer, Wizard",
        "archetype": "Cleric: Trickery",
        "domains": "Trickery"
    },
    {
        "name": "Stoneskin",
        "desc": "<p>This spell turns the flesh of a willing creature you touch as hard as stone. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage.</p>",
        "page": "phb 278",
        "range": "Touch",
        "components": "V, S, M",
        "material": "Diamond dust worth 100 gp, which the spell consumes.",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Abjuration",
        "class": "Cleric, Druid, Paladin, Ranger, Sorcerer, Wizard",
        "archetype": "Cleric: War<br/> Paladin: Ancients",
        "domains": "War",
        "circles": "Mountain",
        "oaths": "Ancients"
    },
    {
        "name": "Storm Sphere",
        "desc": "<p>A 20-foot-radius sphere of whirling air springs into existence centered on a point you choose within range. The sphere remains for the spell's duration. Each creature in the sphere when it appears or that ends its turn there must succeed on a Strength saving throw or take 2d6 bludgeoning damage. The sphere's space is difficult terrain.</p><p>Until the spell ends, you can use a bonus action on each of your turns to cause a bolt of lightning to leap from the center of the sphere toward one creature you choose within 60 feet of the center. Make a ranged spell attack. You have advantage on the attack roll if the target is in the sphere. On a hit, the target takes 4d6 lightning damage.</p><p>Creatures within 30 feet of the sphere have disadvantage on Wisdom (Perception) checks made to listen.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 5th level or higher, the damage increases for each of its effects by 1d6 for each slot level above 4th.</p>",
        "page": "ee pc 22",
        "range": "150 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Vitriolic Sphere",
        "desc": "<p>You point at a place within range, and a glowing 1-foot ball of emerald acid streaks there and explodes in a 20-foot radius. Each creature in that area must make a Dexterity saving throw. On a failed save, a creature takes 10d4 acid damage and 5d4 acid damage at the end of its next turn. On a successful save, a creature takes half the initial damage and no damage at the end of its next turn.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 5th level or higher, the initial damage increases by 2d4 for each slot level above 4th.</p>",
        "page": "ee pc 23",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "A drop of a giant slug bile.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Wall of Fire",
        "desc": "<p>You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.</p><p>When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.</p><p>One side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet o f that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side o f the wall deals no damage.</p><p>The other side of the wall deals no damage.</p>",
        "higher_level": "<p>When you cast this spell using a level spell slot 5 or more, the damage of the spell increases by 1d8 for each level of higher spell slot to 4.</p>",
        "page": "phb 285",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A small piece of phosphorus.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Evocation",
        "class": "Cleric, Druid, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Light<br/> Warlock: Fiend",
        "domains": "Light",
        "patrons": "Fiend"
    },
    {
        "name": "Watery Sphere",
        "desc": "<p>You conjure up a sphere of water with a 10-foot radius on a point you can see within range. The sphere can hover in the air, but no more than 10 feet off the ground. The sphere remains for the spell's duration.</p><p>Any creature in the sphere's space must make a Strength saving throw. On a successful save, a creature is ejected from that space to the nearest unoccupied space outside it. A Huge or larger creature succeeds on the saving throw automatically. On a failed save, a creature is restrained by the sphere and is engulfed by the water. At the end of each of its turns, a restrained target can repeat the saving throw.</p><p>The sphere can restrain a maximum of four Medium or smaller creatures or one Large creature. If the sphere restrains a creature in excess of these numbers, a random creature that was already restrained by the sphere falls out of it and lands prone in a space within 5 feet of it.</p><p>As an action, you can move the sphere up to 30 feet in a straight line. If it moves over a pit, cliff, or other drop, it safely descends until it is hovering 10 feet over ground. Any creature restrained by the sphere moves with it. You can ram the sphere into creatures, forcing them to make the saving throw, but no more than once per turn.</p><p>When the spell ends, the sphere falls to the ground and extinguishes all normal flames within 30 feet of it. Any creature restrained by the sphere is knocked prone in the space where it falls.</p>",
        "page": "ee pc 23",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A droplet of water.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "school": "Conjuration",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Animate Objects",
        "desc": "<p>Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can’t animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points.</p><p>As a bonus action, you can mentally command any creature you made with this spell if the creature is within 500 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.</p><p>An animated object is a construct with AC, hit points, attacks, Strength, and Dexterity determined by its size. Its Constitution is 10 and its Intelligence and Wisdom are 3, and its Charisma is 1. Its speed is 30 feet; if the object lacks legs or other appendages it can use for locomotion, it instead has a flying speed of 30 feet and can hover. If the object is securely attached to a surface or a larger object, such as a chain bolted to a wall, its speed is 0. It has blindsight with a radius of 30 feet and is blind beyond that distance. When the animated object drops to 0 hit points, it reverts to its original object form, and any remaining damage carries over to its original object form.</p><p>If you command an object to attack, it can make a single melee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and bludgeoning damage determined by its size. The DM might rule that a specific object inflicts slashing or piercing damage based on its form.</p>",
        "higher_level": "<p>If you cast this spell using a spell slot of 6th level or higher, you can animate two additional objects for each slot level above 5th.</p>",
        "page": "phb 213",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Transmutation",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Cloudkill",
        "desc": "<p>You create a 20-foot-radius sphere of poisonous, yellow-green fog centered on a point you choose within range. The fog spreads around corners. It lasts for the duration or until strong wind disperses the fog, ending the spell. Its area is heavily obscured.</p><p>When a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a constitution saving throw. The creature takes 5d8 poison damage on a failed save, or half as much damage on a successful one. Creatures are affected even if they hold their breath or don't need to breathe.</p><p>The fog moves 10 feet away from you at the start of each of your turns, rolling along the surface of the ground. The vapors, being heavier than air, sink to the lowest level of the land, even pouring down openings.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.</p>",
        "page": "phb 222",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Conjuration",
        "class": "Druid, Sorcerer, Wizard",
        "archetype": "Druid: Underdark",
        "circles": "Underdark"
    },
    {
        "name": "Cone of Cold",
        "desc": "<p>A blast of cold air erupts from your hands. Each creature in a 60-foot cone must make a constitution saving throw. A creature takes 8d8 cold damage on a failed save, or half as much damage on a successful one.</p><p>A creature killed by this spell becomes a frozen statue until it thaws.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.</p>",
        "page": "phb 224",
        "range": "Self",
        "components": "V, S, M",
        "material": "A small crystal or glass cone.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Wizard",
        "archetype": "Druid: Arctic",
        "circles": "Arctic"
    },
    {
        "name": "Control Winds",
        "desc": "<p>You take control of the air in a 100-foot cube that you can see within range. Choose one of the following effects when you cast the spell. The effect lasts for the spell's duration, unless you use your action on a later turn to switch to a different effect. You can also use your action to temporarily halt the effect or to restart one you've halted.</p><p>Gusts. A wind picks up within the cube, continually blowing in a horizontal direction that you choose. You choose the intensity of the wind: calm, moderate, or strong. If the wind is moderate or strong, ranged weapon attacks that pass through it or that are made against targets within the cube have disadvantage on their attack rolls. If the wind is strong, any creature moving against the wind must spend 1 extra foot of movement for each foot moved.</p><p>Downdraft. You cause a sustained blast of strong wind to blow downward from the top of the cube. Ranged weapon attacks that pass through the cube or that are made against targets within it have disadvantage on their attack rolls. A creature must make a Strength saving throw if it flies into the cube for the first time on a turn or starts its turn there flying. On a failed save, the creature is knocked prone.</p><p>Updraft. You cause a sustained updraft within the cube, rising upward from the cube's bottom edge. Creatures that end a fall within the cube take only half damage from the fall. When a creature in the cube makes a vertical jump, the creature can jump up to 10 feet higher than normal.</p>",
        "page": "ee pc 16",
        "range": "300 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Creation",
        "desc": "<p>You pull wisps of shadow material from the Shadowfell to create a nonliving object of vegetable matter within 'range': soft goods, rope, wood, or something similar. You can also use this spell to create mineral objects such as stone, crystal, or metal. The object created must be no larger than a 5-foot cube, and the object must be of a form and material that you have seen before.</p><p>The duration depends on the object’s material. If the object is composed of multiple materials, use the shortest duration.</p><p><b>Vegetable matter</b> 1 day</p><p><b>Stone or crystal</b> 12 hours</p><p><b>Precious metals</b> 1 hour</p><p><b>Gems</b> 10 minutes</p><p><b>Adamantine or mithral</b> 1 minute</p><p>Using any material created by this spell as another spell’s material component causes that spell to fail.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 6th level or higher, the cube increases by 5 feet for each slot level above 5th.</p>",
        "page": "phb 229",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "A tiny piece of matter of the same type of the item you plan to create.",
        "ritual": "no",
        "duration": "Special",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "5th-level",
        "school": "Illusion",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Dominate Person",
        "desc": "<p>You attempt to beguile a humanoid that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.</p><p>While the target is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Attack that creature,” “Run over there,” or “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability.</p><p>You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.</p><p>Each time the target takes damage, it makes a new wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell using a 6th-level spell slot, the duration is concentration, up to 10 minutes. When you use a 7th-level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 8th level or higher, the duration is concentration, up to 8 hours.</p>",
        "page": "phb 235",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: Trickery<br/> Warlock: Archfey, Great Old One",
        "domains": "Trickery",
        "patrons": "Archfey, Great Old One"
    },
    {
        "name": "Hold Monster",
        "desc": "<p>Choose a creature you can see and reach. The target must make a saving throw of Wisdom or be paralyzed for the duration of the spell. This spell has no effect against the undead. At the end of each round, the target can make a new saving throw of Wisdom. If successful, the spell ends for the creature.</p>",
        "higher_level": "<p>When you cast this spell using a level 6 or higher location, you can target an additional creature for each level of location beyond the fifth. The creatures must be within 30 feet o f each other when you target them.</p>",
        "page": "phb 251",
        "range": "90 feet",
        "components": "V, S, M",
        "material": "A small piece of iron.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Enchantment",
        "class": "Bard, Cleric, Paladin, Sorcerer, Warlock, Wizard",
        "archetype": "Cleric: War<br/> Paladin: Vengeance",
        "domains": "War",
        "oaths": "Vengeance"
    },
    {
        "name": "Immolation",
        "desc": "<p>Flames wreathe one creature you can see within range. The target must make a Dexterity saving throw. It takes 7d6 fire damage on a failed save, or half as much damage on a successful one. On a failed save, the target also burns for the spell's duration. The burning target sheds bright light in a 30-foot radius and dim light for an additional 30 feet. At the end of each of its turns, the target repeats the saving throw. It takes 3d6 fire damage on a failed save, and the spell ends on a successful one. These magical flames can't be extinguished through nonmagical means.</p><p>If damage from this spell reduces a target to 0 hit points, the target is turned to ash.</p>",
        "page": "ee pc 19",
        "range": "90 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Insect Plague",
        "desc": "<p>Swarming, biting locusts fill a 20-foot-radius sphere centered on a point you choose within range. The sphere spreads around corners. The sphere remains for the duration, and its area is lightly obscured. The sphere's area is difficult terrain.</p><p>When the area appears, each creature in it must make a constitution saving throw. A creature takes 4d10 piercing damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw when it enters the spell's area for the first time on a turn or ends its turn there.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d10 for each slot level above 5th.</p>",
        "page": "phb 254",
        "range": "300 feet",
        "components": "V, S, M",
        "material": "A few grains of sugar, some kernels of grain, and a smear of fat.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Conjuration",
        "class": "Cleric, Druid, Sorcerer",
        "domains": "Nature, Tempest",
        "circles": "Desert, Grassland, Swamp, Underdark"
    },
    {
        "name": "Seeming",
        "desc": "<p>This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a charisma saving throw, and if it succeeds, it is unaffected by this spell.</p><p>The spell disguises physical appearance as well as clothing, armor, weapons, and equipment. You can make each creature seem 1 foot shorter or taller and appear thin, fat, or in between. You can't change a target's body type, so you must choose a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The spell lasts for the duration, unless you use your action to dismiss it sooner.</p><p>The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to a creature's outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel the creature's head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.</p><p>A creature can use its action to inspect a target and make an Intelligence (Investigation) check against your spell save DC. If it succeeds, it becomes aware that the target is disguised.</p>",
        "page": "phb 274",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "8 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Archfey",
        "patrons": "Archfey"
    },
    {
        "name": "Telekinesis",
        "desc": "<p>You gain the ability to move or manipulate creatures or objects by thought. When you cast the spell, and as your action each round for the duration, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below. You can affect the same target round after round, or choose a new one at any time. If you switch targets, the prior target is no longer affected by the spell.</p><p><b>Creature.</b> You can try to move a Huge or smaller creature. Make an ability check with your spellcasting ability contested by the creature’s Strength check. If you win the contest, you move the creature up to 30 feet in any direction, including upward but not beyond the range of this spell. Until the end of your next turn, the creature is restrained in your telekinetic grip. A creature lifted upward is suspended in mid-air.</p><p>On subsequent rounds, you can use your action to attempt to maintain your telekinetic grip on the creature by repeating the contest.</p><p><b>Object.</b> You can try to move an object that weighs up to 1,000 pounds. If the object isn’t being worn or carried, you automatically move it up to 30 feet in any direction, but not beyond the range of this spell.</p><p>If the object is worn or carried by a creature, you must make an ability check with your spellcasting ability contested by that creature’s Strength check. If you succeed, you pull the object away from that creature and can move it up to 30 feet in any direction but not beyond the range of this spell.</p><p>You can exert fine control on objects with your telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or retrieving an item from an open container, or pouring the contents from a vial.</p>",
        "page": "phb 280",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Transmutation",
        "class": "Sorcerer, Warlock, Wizard",
        "archetype": "Warlock: Great Old One",
        "patrons": "Great Old One"
    },
    {
        "name": "Teleportation Circle",
        "desc": "<p>As you cast the spell, you draw a 10-foot-diameter circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you know and that is on the same plane of existence as you. A shimmering portal opens within the circle you drew and remains open until the end of your next turn. Any creature that enters the portal instantly appears within 5 feet of the destination circle or in the nearest unoccupied space if that space is occupied.</p><p>Many major temples, guilds, and other important places have permanent teleportation circles inscribed somewhere within their confines. Each such circle includes a unique sigil sequence—a string of magical runes arranged in a particular pattern. When you first gain the ability to cast this spell, you learn the sigil sequences for two destinations on the Material Plane, determined by the DM. You can learn additional sigil sequences during your adventures. You can commit a new sigil sequence to memory after studying it for 1 minute.</p><p>You can create a permanent teleportation circle by casting this spell in the same location every day for one year. You need not use the circle to teleport when you cast the spell in this way.</p>",
        "page": "phb 282",
        "range": "10 feet",
        "components": "V, M",
        "material": "Rare chalks and inks infused with precious gems with 50 gp, which the spell consumes.",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "5th-level",
        "school": "Conjuration",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Wall of Stone",
        "desc": "<p>A nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. Each panel must be contiguous with at least one other panel. Alternatively, you can create 10-foot-by-20-foot panels that are only 3 inches thick.</p><p>If the wall cuts through a creature’s space when it appears, the creature is pushed to one side of the wall (your choice). If a creature would be surrounded on all sides by the wall (or the wall and another solid surface), that creature can make a dexterity saving throw. On a success, it can use its reaction to move up to its speed so that it is no longer enclosed by the wall.</p><p>The wall can have any shape you desire, though it can’t occupy the same space as a creature or object. The wall doesn’t need to be vertical or rest on any firm foundation. It must, however, merge with and be solidly supported by existing stone. Thus, you can use this spell to bridge a chasm or create a ramp.</p><p>If you create a span greater than 20 feet in length, you must halve the size of each panel to create supports. You can crudely shape the wall to create crenellations, battlements, and so on.</p><p>The wall is an object made of stone that can be damaged and thus breached. Each panel has AC 15 and 30 hit points per inch of thickness. Reducing a panel to 0 hit points destroys it and might cause connected panels to collapse at the DM’s discretion.</p><p>If you maintain your concentration on this spell for its whole duration, the wall becomes permanent and can’t be dispelled. Otherwise, the wall disappears when the spell ends.</p>",
        "page": "phb 287",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A small block of granite.",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Wizard",
        "circles": "Desert, Mountain"
    },
    {
        "name": "Arcane Gate",
        "desc": "<p>You create linked teleportation portals that remain open for the duration. Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. If the portal would open in the space occupied by a creature, the spell fails, and the casting is lost.</p><p>The portals are two-dimensional glowing rings filled with mist, hovering inches from the ground and perpendicular to it at the points you choose. A ring is visible only from one side (your choice), which is the side that functions as a portal.</p><p>Any creature or object entering the portal exits from the other portal as if the two were adjacent to each other; passing through a portal from the nonportal side has no effect. The mist that fills each portal is opaque and blocks vision through it. On your turn, you can rotate the rings as a bonus action so that the active side faces in a different direction.</p>",
        "page": "phb 214",
        "range": "500 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Conjuration",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Chain Lightning",
        "desc": "<p>You create a bolt of lightning that arcs toward a target of your choice that you can see within range. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts.</p><p>A target must make a dexterity saving throw. The target takes 10d8 lightning damage on a failed save, or half as much damage on a successful one.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 7th level or higher, one additional bolt leaps from the first target to another target for each slot level above 6th.</p>",
        "page": "phb 221",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "A bit of fur; a piece of amber, glass, or a crystal rod; and three silver pins.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Circle of Death",
        "desc": "<p>A sphere of negative energy ripples out in a 60-footradius sphere from a point within range. Each creature in that area must make a constitution saving throw. A target takes 8d6 necrotic damage on a failed save, or half as much damage on a successful one.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 7th level or higher, the damage increases by 2d6 for each slot level above 6th.</p>",
        "page": "phb 221",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "The powder of a crushed black pearl worth at least 500 gp.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Necromancy",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Disintegrate",
        "desc": "<p>A thin green ray springs from your pointing finger to a target that you can see within range. The target can be a creature, an object, or a creation of magical force, such as the wall created by wall of force.</p><p>A creature targeted by this spell must make a dexterity saving throw. On a failed save, the target takes 10d6 + 40 force damage. If this damage reduces the target to 0 hit points, it is disintegrated.</p><p>A disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust. The creature can be restored to life only by means of a true resurrection or a wish spell.</p><p>This spell automatically disintegrates a Large or smaller nonmagical object or a creation of magical force. If the target is a Huge or larger object or creation of force, this spell disintegrates a 10-foot-cube portion of it. A magic item is unaffected by this spell.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 7th level or higher, the damage increases by 3d6 for each slot level above 6th.</p>",
        "page": "phb 233",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A lodestone and a pinch of dust.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Eyebite",
        "desc": "<p>For the spell’s duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can’t target a creature again if it has succeeded on a saving throw against this casting of eyebite.</p><p><b>Asleep.</b> The target falls unconscious. It wakes up if it takes any damage or if another creature uses its action to shake the sleeper awake.</p><p><b>Panicked.</b> The target is frightened of you. On each of its turns, the frightened creature must take the Dash action and move away from you by the safest and shortest available route, unless there is nowhere to move. If the target moves to a place at least 60 feet away from you where it can no longer see you, this effect ends.</p><p><b>Sickened.</b> The target has disadvantage on attack rolls and ability checks. At the end of each of its turns, it can make another wisdom saving throw. If it succeeds, the effect ends.</p>",
        "page": "phb 238",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Necromancy",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Globe of Invulnerability",
        "desc": "<p>An immobile, faintly shimmering barrier springs into existence in a 10-foot radius around you and remains for the duration.</p><p>Any spell of 5th level or lower cast from outside the barrier can’t affect creatures or objects within it, even if the spell is cast using a higher level spell slot. Such a spell can target creatures and objects within the barrier, but the spell has no effect on them. Similarly, the area within the barrier is excluded from the areas affected by such spells.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 7th level or higher, the barrier blocks spells of one level higher for each slot level above 6th.</p>",
        "page": "phb 245",
        "range": "Self",
        "components": "V, S, M",
        "material": "A glass or crystal bead that shatters when the spell ends.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Abjuration",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Investiture of Flame",
        "desc": "<p>Flames race across your body, shedding bright light in a 30-foot radius and dim light for an additional 30 feet for the spell's duration. The flames don't harm you. Until the spell ends, you gain the following benefits:</p><p>- You are immune to fire damage and have resistance to cold damage.</p><p>- Any creature that moves within 5 feet of you for the first time on a turn or ends its turn there takes 1d10 fire damage.</p><p>- You can use your action to create a line of fire 15 feet long and 5 feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 4d8 fire damage on a failed save, or half as much damage on a successful one.</p>",
        "page": "ee pc 19",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Investiture of Ice",
        "desc": "<p>Until the spell ends, ice rimes your body, and you gain the following benefits:</p><p>- You are immune to cold damage and have resistance to fire damage.</p><p>- You can move across difficult terrain created by ice or snow without spending extra movement.</p><p>- The ground in a 10-foot radius around you is icy and is difficult terrain for creatures other than you. The radius moves with you.</p><p>- You can use your action to create a 15-foot cone of freezing wind extending from your outstretched hand in a direction you choose. Each creature in the cone must make a Constitution saving throw. A creature takes 4d6 cold damage on a failed save, or half as much damage on a successful one. A creature that fails its save against this effect has its speed halved until the start of your next turn.</p>",
        "page": "ee pc 19",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Investiture of Stone",
        "desc": "<p>Until the spell ends, bits of rock spread across your body, and you gain the following benefits:</p><p>- You have resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.</p><p>- You can use your action to create a small earthquake on the ground in a 15-foot radius centered on you. Other creatures on that ground must succeed on a Dexterity saving throw or be knocked prone.</p><p>- You can move across difficult terrain made of earth or stone without spending extra movement. You can move through solid earth or stone as if it was air and without destabilizing it, but you can't end your movement there. If you do so, you are ejected to the nearest unoccupied space, this spell ends, and you are stunned until the end of your next turn.</p>",
        "page": "ee pc 19",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Investiture of Wind",
        "desc": "<p>Until the spell ends, wind whirls around you, and you gain the following benefits:</p><p>- Ranged weapon attacks made against you have disadvantage on the attack roll.</p><p>- You gain a flying speed of 60 feet. If you are still flying when the spell ends, you fall, unless you can somehow prevent it.</p><p>- You can use your action to create a 15-foot cube of swirling wind centered on a point you can see within 60 feet of you. Each creature in that area must make a Constitution saving throw. A creature takes 2d10 bludgeoning damage on a failed save, or half as much damage on a successful one. If a Large or smaller creature fails the save, that creature is also pushed up to 10 feet away from the center of the cube.</p>",
        "page": "ee pc 20",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Mass Suggestion",
        "desc": "<p>You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell.</p><p>Each target must make a wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.</p><p>You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a group of soldiers give all their money to the first beggar they meet. If the condition isn’t met before the spell ends, the activity isn’t performed.</p><p>If you or any of your companions damage a creature affected by this spell, the spell ends for that creature.</p>",
        "higher_level": "<p>When you cast this spell using a 7th-level spell slot, the duration is 10 days. When you use an 8th-level spell slot, the duration is 30 days. When you use a 9th-level spell slot, the duration is a year and a day.</p>",
        "page": "phb 258",
        "range": "60 feet",
        "components": "V, M",
        "material": "A snake’s tongue and either a bit of honeycomb or a drop of sweet oil.",
        "ritual": "no",
        "duration": "24 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Move Earth",
        "desc": "<p>Choose an area of terrain no larger than 40 feet on a side within range. You can reshape dirt, sand, or clay in the area in any manner you choose for the duration. You can raise or lower the area's elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can't exceed half the area's largest dimension. So, if you affect a 40-foot square, you can create a pillar up to 20 feet high, raise or lower the square's elevation by up to 20 feet, dig a trench up to 20 feet deep, and so on. It takes 10 minutes for these changes to complete.</p><p>At the end of every 10 minutes you spend concentrating on the spell, you can choose a new area of terrain to affect.</p><p>Because the terrain's transformation occurs slowly, creatures in the area can't usually be trapped or injured by the ground's movement.</p><p>This spell can't manipulate natural stone or stone construction. Rocks and structures shift to accommodate the new terrain. If the way you shape the terrain would make a structure unstable, it might collapse.</p><p>Similarly, this spell doesn't directly affect plant growth. The moved earth carries any plants along with it.</p>",
        "page": "phb 263",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "An iron blade and a small bag containing a mixture of soils—clay, loam, and sand.",
        "ritual": "no",
        "duration": "Up to 2 hours",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Permanent Image",
        "desc": "<p>You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts until dispelled. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench).</p><p>As long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.</p><p>Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.</p>",
        "page": "trot spells 36",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A bit of fleece.",
        "ritual": "no",
        "duration": "Until dispelled",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Sunbeam",
        "desc": "<p>A beam of brilliant light flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a constitution saving throw. On a failed save, a creature takes 6d8 radiant damage and is blinded until your next turn. On a successful save, it takes half as much damage and isn’t blinded by this spell. Undead and oozes have disadvantage on this saving throw.</p><p>You can create a new line of radiance as your action on any turn until the spell ends.</p><p>For the duration, a mote of brilliant radiance shines in your hand. It sheds bright light in a 30-foot radius and dim light for an additional 30 feet. This light is sunlight.</p>",
        "page": "phb 279",
        "range": "Self",
        "components": "V, S, M",
        "material": "A magnifying glass.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "True Seeing",
        "desc": "<p>This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet.</p>",
        "page": "phb 284",
        "range": "Touch",
        "components": "V, S, M",
        "material": "An ointment for the eyes that costs 25gp; is made from mushroom powder, saffron, and fat; and is consumed by the spell.",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "school": "Divination",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Delayed Blast Fireball",
        "desc": "<p>A beam of yellow light flashes from your pointing finger, then condenses to linger at a chosen point within range as a glowing bead for the duration. When the spell ends, either because your concentration is broken or because you decide to end it, the bead blossoms with a low roar into an explosion of flame that spreads around corners. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A creature takes fire damage equal to the total accumulated damage on a failed save, or half as much damage on a successful one.</p><p>The spell’s base damage is 12d6. If at the end of your turn the bead has not yet detonated, the damage increases by 1d6.</p><p>If the glowing bead is touched before the interval has expired, the creature touching it must make a dexterity saving throw. On a failed save, the spell ends immediately, causing the bead to erupt in flame. On a successful save, the creature can throw the bead up to 40 feet. When it strikes a creature or a solid object, the spell ends, and the bead explodes.</p><p>The fire damages objects in the area and ignites flammable objects that aren’t being worn or carried.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 8th level or higher, the base damage increases by 1d6 for each slot level above 7th.</p>",
        "page": "phb 230",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "A tiny ball of bat guano and sulfur.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "7th-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Etherealness",
        "desc": "<p>You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can’t see anything more than 60 feet away.</p><p>While on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures that aren’t on the Ethereal Plane can’t perceive you and can’t interact with you, unless a special ability or magic has given them the ability to do so.</p><p>You ignore all objects and effects that aren’t on the Ethereal Plane, allowing you to move through objects you perceive on the plane you originated from.</p><p>When the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved.</p><p>This spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn’t border it, such as one of the Outer Planes.</p>",
        "higher_level": "<p>When you cast this spell using a spell slot of 8th level or higher, you can target up to three willing creatures (including you) for each slot level above 7th. The creatures must be within 10 feet of you when you cast the spell.</p>",
        "page": "phb 238",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "8 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "7th-level",
        "school": "Transmutation",
        "class": "Bard, Cleric, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Finger of Death",
        "desc": "<p>You send negative energy coursing through a creature that you can see within range, causing it searing pain. The target must make a constitution saving throw. It takes 7d8 + 30 necrotic damage on a failed save, or half as much damage on a successful one.</p><p>A humanoid killed by this spell rises at the start of your next turn as a zombie that is permanently under your command, following your verbal orders to the best of its ability.</p>",
        "page": "phb 241",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "7th-level",
        "school": "Necromancy",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Fire Storm",
        "desc": "<p>A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to ten 10-foot cubes, which you can arrange as you wish. Each cube must have at least one face adjacent to the face of another cube. Each creature in the area must make a dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one.</p><p>The fire damages objects in the area and ignites flammable objects that aren’t being worn or carried. If you choose, plant life in the area is unaffected by this spell.</p>",
        "page": "phb 242",
        "range": "150 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "7th-level",
        "school": "Evocation",
        "class": "Cleric, Druid, Sorcerer"
    },
    {
        "name": "Plane Shift",
        "desc": "<p>You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM’s discretion.</p><p>Alternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle.</p><p>You can use this spell to banish an unwilling creature to another plane. Choose a creature within your reach and make a melee spell attack against it. On a hit, the creature must make a charisma saving throw. If the creature fails this save, it is transported to a random location on the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence.</p>",
        "page": "phb 266",
        "range": "Touch",
        "components": "V, S, M",
        "material": "A forked, metal rod worth at least 250 gp, attuned to a particular plane of existence.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "7th-level",
        "school": "Conjuration",
        "class": "Cleric, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Prismatic Spray",
        "desc": "<p>Eight multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 60-foot cone must make a dexterity saving throw. For each target, roll a d8 to determine which color ray affects it.</p><p><b>1. Red.</b> The target takes 10d6 fire damage on a failed save, or half as much damage on a successful one.</p><p><b>2. Orange.</b> The target takes 10d6 acid damage on a failed save, or half as much damage on a successful one.</p><p><b>3. Yellow.</b> The target takes 10d6 lightning damage on a failed save, or half as much damage on a successful one.</p><p><b>4. Green.</b> The target takes 10d6 poison damage on a failed save, or half as much damage on a successful one.</p><p><b>5. Blue.</b> The target takes 10d6 cold damage on a failed save, or half as much damage on a successful one.</p><p><b>6. Indigo.</b> On a failed save, the target is restrained. It must then make a constitution saving throw at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures don’t need to be consecutive; keep track of both until the target collects three of a kind.</p><p><b>7. Violet.</b> On a failed save, the target is blinded. It must then make a wisdom saving throw at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of existence of the DM’s choosing and is no longer blinded. (Typically, a creature that is on a plane that isn’t its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes.)</p><p><b>8. Special.</b> The target is struck by two rays. Roll twice more, rerolling any 8.</p>",
        "page": "phb 267",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "7th-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Reverse Gravity",
        "desc": "<p>This spell reverses gravity in a 50-foot-radius, 100-foot high cylinder centered on a point within range. All creatures and objects that aren’t somehow anchored to the ground in the area fall upward and reach the top of the area when you cast this spell. A creature can make a dexterity saving throw to grab onto a fixed object it can reach, thus avoiding the fall.</p><p>If some solid object (such as a ceiling) is encountered in this fall, falling objects and creatures strike it just as they would during a normal downward fall. If an object or creature reaches the top of the area without striking anything, it remains there, oscillating slightly, for the duration.</p><p>At the end of the duration, affected objects and creatures fall back down.</p>",
        "page": "phb 272",
        "range": "100 feet",
        "components": "V, S, M",
        "material": "A lodestone and iron filings.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "7th-level",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Teleport",
        "desc": "<p>This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can’t be held or carried by an unwilling creature.</p><p>The destination you choose must be known to you, and it must be on the same plane of existence as you. Your familiarity with the destination determines whether you arrive there successfully. The DM rolls d100 and consults the table.</p>",
        "page": "phb 281",
        "range": "10 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "7th-level",
        "school": "Conjuration",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Abi-Dalzim's Horrid Wilting",
        "desc": "<p>You draw the moisture from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and undead aren't affected, and plants and water elementals make this saving throw with disadvantage. A creature takes 10d8 necrotic damage on a failed save, or half as much damage on a successful one.You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or take 1d6 acid damage.</p><p>This spells damage increases by 1d6 when you reach 5th Level (2d6), 11th level (3d6) and 17th level (4d6).</p>",
        "page": "ee pc 15",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "A bit of sponge.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "8th-level",
        "school": "Necromancy",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Dominate Monster",
        "desc": "<p>You attempt to beguile a creature that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.</p><p>While the creature is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Attack that creature,” “Run over there,” or “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability.</p><p>You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.</p><p>Each time the target takes damage, it makes a new wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.</p>",
        "higher_level": "<p>When you cast this spell with a 9th-level spell slot, the duration is concentration, up to 8 hours.</p>",
        "page": "phb 235",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "8th-level",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Earthquake",
        "desc": "<p>You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area.</p><p>The ground in the area becomes difficult terrain. Each creature on the ground that is concentrating must make a constitution saving throw. On a failed save, the creature’s concentration is broken.</p><p>When you cast this spell and at the end of each turn you spend concentrating on it, each creature on the ground in the area must make a dexterity saving throw. On a failed save, the creature is knocked prone.</p><p>This spell can have additional effects depending on the terrain in the area, as determined by the DM.</p><p>Fissures. Fissures open throughout the spell’s area at the start of your next turn after you cast the spell. A total of 1d6 such fissures open in locations chosen by the DM. Each is 1d10 × 10 feet deep, 10 feet wide, and extends from one edge of the spell’s area to the opposite side. A creature standing on a spot where a fissure opens must succeed on a dexterity saving throw or fall in. A creature that successfully saves moves with the fissure’s edge as it opens.</p><p>A fissure that opens beneath a structure causes it to automatically collapse (see below).</p><p>Structures. The tremor deals 50 bludgeoning damage to any structure in contact with the ground in the area when you cast the spell and at the start of each of your turns until the spell ends. If a structure drops to 0 hit points, it collapses and potentially damages nearby creatures. A creature within half the distance of a structure’s height must make a dexterity saving throw. On a failed save, the creature takes 5d6 bludgeoning damage, is knocked prone, and is buried in the rubble, requiring a DC 20 Strength (Athletics) check as an action to escape. The DM can adjust the DC higher or lower, depending on the nature of the rubble. On a successful save, the creature takes half as much damage and doesn’t fall prone or become buried.</p>",
        "page": "phb 236",
        "range": "500 feet",
        "components": "V, S, M",
        "material": "A pinch of dirt, a piece of rock, and a lump of clay.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "8th-level",
        "school": "Evocation",
        "class": "Cleric, Druid, Sorcerer"
    },
    {
        "name": "Incendiary Cloud",
        "desc": "<p>A swirling cloud of smoke shot through with white-hot embers appears in a 20-foot-radius sphere centered on a point within range. The cloud spreads around corners and is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.</p><p>When the cloud appears, each creature in it must make a dexterity saving throw. A creature takes 10d8 fire damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw when it enters the spell’s area for the first time on a turn or ends its turn there.</p><p>The cloud moves 10 feet directly away from you in a direction that you choose at the start of each of your turns.</p>",
        "page": "phb 253",
        "range": "150 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "8th-level",
        "school": "Conjuration",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Power Word Stun",
        "desc": "<p>You speak a word of power that can overwhelm the mind of one creature you can see within range, leaving it dumbfounded. If the target has 150 hit points or fewer, it is stunned. Otherwise, the spell has no effect.</p><p>The stunned target must make a constitution saving throw at the end of each of its turns. On a successful save, this stunning effect ends.</p>",
        "page": "phb 267",
        "range": "60 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "8th-level",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Sunburst",
        "desc": "<p>Brilliant sunlight flashes in a 60-foot radius centered on a point you choose within range. Each creature in that light must make a constitution saving throw. On a failed save, a creature takes 12d6 radiant damage and is blinded for 1 minute. On a successful save, it takes half as much damage and isn’t blinded by this spell. Undead and oozes have disadvantage on this saving throw.</p><p>A creature blinded by this spell makes another constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded.</p><p>This spell dispels any darkness in its area that was created by a spell.</p>",
        "page": "phb 279",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "Fire and a piece of sunstone.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "8th-level",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Gate",
        "desc": "<p>You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration.</p><p>The portal has a front and a back on each plane where it appears. Travel through the portal is possible only by moving through its front. Anything that does so is instantly transported to the other plane, appearing in the unoccupied space nearest to the portal.</p><p>Deities and other planar rulers can prevent portals created by this spell from opening in their presence or anywhere within their domains.</p><p>When you cast this spell, you can speak the name of a specific creature (a pseudonym, title, or nickname doesn’t work). If that creature is on a plane other than the one you are on, the portal opens in the named creature’s immediate vicinity and draws the creature through it to the nearest unoccupied space on your side of the portal. You gain no special power over the creature, and it is free to act as the DM deems appropriate. It might leave, attack you, or help you.</p>",
        "page": "phb 244",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "A diamond worth at least 5,000gp.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "9th-level",
        "school": "Conjuration",
        "class": "Cleric, Sorcerer, Wizard"
    },
    {
        "name": "Meteor Swarm",
        "desc": "<p>Blazing orbs of fire plummet to the ground at four different points you can see within range. Each creature in a 40-foot-radius sphere centered on each point you choose must make a dexterity saving throw. The sphere spreads around corners. A creature takes 20d6 fire damage and 20d6 bludgeoning damage on a failed save, or half as much damage on a successful one. A creature in the area of more than one fiery burst is affected only once.</p><p>The spell damages objects in the area and ignites flammable objects that aren’t being worn or carried.</p>",
        "page": "phb 259",
        "range": "1 mile",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "9th-level",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Power Word Kill",
        "desc": "<p>You utter a word of power that can compel one creature you can see within range to die instantly. If the creature you choose has 100 hit points or fewer, it dies. Otherwise, the spell has no effect.</p>",
        "page": "phb 266",
        "range": "60 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "9th-level",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Time Stop",
        "desc": "<p>You briefly stop the flow of time for everyone but yourself. No time passes for other creatures, while you take 1d4 + 1 turns in a row, during which you can use actions and move as normal.</p><p>This spell ends if one of the actions you use during this period, or any effects that you create during this period, affects a creature other than you or an object being worn or carried by someone other than you. In addition, the spell ends if you move to a place more than 1,000 feet from the location where you cast it.</p>",
        "page": "phb 283",
        "range": "Self",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "9th-level",
        "school": "Transmutation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Wish",
        "desc": "<p>Desire is the most powerful spell a deadly creature can throw. Simply by speaking aloud, you can alter the very foundations of reality as you wish.</p><p>The most basic use of this spell is to duplicate any other out of 8th level or lower. You only need to fill out any conditions for that, not even the need for costly components. The fate simply takes effect. You can also create one of the following effects of your choice:</p><p>- You create one object of up to 25,000 gp in value that isn’t a magic item. The object can be no more than 300 feet in any dimension, and it appears in an unoccupied space you can see on the ground.</p><p>- You allow a maximum of twenty creatures you can see to get all their points and you dispel all effects affecting them, as described in greater restoration spell.</p><p>- You grant to a maximum of ten creatures you can see resistance to a damage type you choose.</p><p>- You grant to a maximum of ten creatures you can see immunity to a single spell or other magical effect for 8 hours. For example, you can immunize yourself and your companions against the attack of the Lich draining.</p><p>- You cancel a recent event unique by requiring a new replacement jet diced any jet made during the last round (including your last turn). The reality is transformed to match the new launch. For example, a wish spell can cancel a successful saving throw enemy critical strike an opponent or ally saving throw missed. You can impose a jet with advantage or disadvantage, and you can choose to use the new result of the start or the old.</p><p>You can also do other things than the above examples. Describe your wishes to your MD in the most accurate way possible. The DM is free to determine what happens in this case; more desire, the more likely it is that something goes wrong. This spell may simply fail, the effect you want might be only partially executed, or you may suffer from unpredictable consequences depending on your formulation wish. For example, want an enemy died could propel you to a future time when your enemy is no longer alive, you effectively eliminating the game. Similarly, desiring a legendary magical object or artifact could carry you instantaneously in the presence of the current owner of the object.</p><p>Stress to cast this spell to produce an effect other than the reproduction of another spell weakens you. After undergoing this tension every time you cast a spell, and this until your next extended rest, you suffer 1d10 necrotic damage per spell level. This damage can not be reduced or avoided in any way. In addition, your Force falls to 3, if it is not already less than 3, for 2d4 days. For each day spent resting or practicing a minor activity, your recovery time decreases by 2 days. Finally, you have a 33% chance of never being able to cast the spell if you wish undergoes stress.</p>",
        "page": "phb 288",
        "range": "Self",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "9th-level",
        "school": "Conjuration",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Acid Splash",
        "desc": "<p>You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a dexterity saving throw or take 1d6 acid damage.</p> <p>This spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>",
        "page": "phb 211",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Conjuration",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Blade Ward",
        "desc": "<p>You extend your hand and trace a sigil of warding in the air. Until the end of your next turn, you have resistance against bludgeoning, piercing, and slashing damage dealt by weapon attacks.</p>",
        "page": "phb 218",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Abjuration",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Booming Blade",
        "desc": "<p>As part of the action used the cast this spell, you must make a melee attack with a weapon against one creature within the spell's range otherwise the spell fails. On a hit, the target suffers the attack's normal effects, and it becomes sheathed in booming energy until the start of your next turn. If the target willingly moves before then, it immediately takes 1d8 thunder damage, and the spell ends.</p><p>This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 thunder damage to the target, and the damage the target take for moving increases to 2d8. Both damage rolls increase by 1d8 at 11th level and 17th level.</p>",
        "page": "scag 142",
        "range": "5 feet",
        "components": "V, M",
        "material": "A weapon.",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Chill Touch",
        "desc": "<p>You create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes 1d8 necrotic damage, and it can’t regain hit points until the start of your next turn. Until then, the hand clings to the target.</p><p>If you hit an undead target, it also has disadvantage on attack rolls against you until the end of your next turn.</p><p>This spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>",
        "page": "phb 221",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Necromancy",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Control Flames",
        "desc": "<p>You choose nonmagical flame that you can see within range and that fits within a 5-foot cube. You affect it in one of the following ways:</p><p>- You instantaneously expand the flame 5 feet in one direction, provided that wood or other fuel is present in the new location.</p><p>- You instantaneously extinguish the flames within the cube.</p><p>- You double or halve the area of bright light and dim light cast by the flame, change its color, or both. The change lasts for 1 hour.</p><p>- You cause simple shapes-such as the vague form of a creature, an inanimate object, or a location-to appear within the flames and animate as you like. The shapes last for 1 hour.</p><p>If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.</p>",
        "page": "ee pc 16",
        "range": "60 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Instantaneous/1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Create Bonfire",
        "desc": "<p>You create a bonfire on ground that you can see within range. Until the spells ends, the bonfire fills a 5-foot cube. Any creature in the bonfire's space when you cast the spell must succeed on a Dexterity saving throw or take 1d8 fire damage. A creature must also make the saving throw when it enters the bonfire's space for the first time on a turn or ends its turn there.</p><p>The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>",
        "page": "ee pc 16",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Conjuration",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Dancing Lights",
        "desc": "<p>You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10-foot radius.</p><p>As a bonus action on your turn, you can move the lights up to 60 feet to a new spot within range. A light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spell’s range.</p>",
        "page": "phb 230",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A bit of phosphorus or wychwood, or a glowworm.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Fire Bolt",
        "desc": "<p>You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn’t being worn or carried.</p><p>This spell’s damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).</p>",
        "page": "phb 242",
        "range": "120 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Friends",
        "desc": "<p>For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn’t hostile toward you. When the spell ends, the creature realizes that you have used magic to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM’s discretion), depending on the nature of your interaction with it.</p>",
        "page": "phb 244",
        "range": "Self",
        "components": "S, M",
        "material": "A small amount of makeup applied to the face as this spell is cast.",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Enchantment",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Frostbite",
        "desc": "<p>You cause numbing frost to form on one creature that you can see within range. The target must make a Constitution saving throw. On a failed save, the target takes 1d6 cold damage, and it has disadvantage on the next weapon attack roll it makes before the end of its next turn.</p><p>The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>",
        "page": "ee pc 18",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Green-Flame Blade",
        "desc": "<p>As part of the action used the cast this spell, you must make a melee attack with a weapon against one creature within the spell's range otherwise the spell fails. On a hit, the target suffers the attack's normal effects, and green fire leaps from the target to a different creature of your choice that you can see within 5 feet of it. The second creature take fire damage equal to your spellcasting modifier.</p><p>This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 fire damage to the target, and the fire damage to the second creature increases to 18d + your spellcasting ability modifier. Both damage rolls increase by 1d8 at 11th level and 17th level.</p>",
        "page": "scag 143",
        "range": "5 feet",
        "components": "V, M",
        "material": "A weapon.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Gust",
        "desc": "<p>You seize the air and compel it to create one of the following effects at a point you can see within 'range':</p><p>- One Medium or smaller creature that you choose must succeed on a Strength saving throw or be pushed up to 5 feet away from you.</p><p>- You create a small blast of air capable of moving one object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you. It isn't pushed with enough force to cause damage.</p><p>- You create a harmless sensory affect using air, such as causing leaves to rustle, wind to slam shutters shut, or your clothing to ripple in a breeze.</p>",
        "page": "ee pc 19",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Light",
        "desc": "<p>You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.</p><p>If you target an object held or worn by a hostile creature, that creature must succeed on a dexterity saving throw to avoid the spell.</p>",
        "page": "phb 255",
        "range": "Touch",
        "components": "V, M",
        "material": "A firefly or phosphorescent moss.",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Bard, Cleric, Sorcerer, Wizard"
    },
    {
        "name": "Lightning Lure",
        "desc": "<p>You create a lash of lightning energy that strikes at one creature of your choice that you can see within range. The target must succeed on a Strength saving throw or be pulled up to 10 feet in a straight line toward you and then take 1d8 lightning damage if it is within 5 feet of you.</p><p>This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>",
        "page": "scag 143",
        "range": "15 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Mage Hand",
        "desc": "<p>A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.</p><p>You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.</p><p>The hand can’t attack, activate magic items, or carry more than 10 pounds.</p>",
        "page": "phb 256",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Conjuration",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Mending",
        "desc": "<p>This spell repairs a single break or tear in an object you touch, such as a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no longer than 1 foot in any dimension, you mend it, leaving no trace of the former damage.</p><p>This spell can physically repair a magic item or construct, but the spell can’t restore magic to such an object.</p>",
        "page": "phb 259",
        "range": "Touch",
        "components": "V, S, M",
        "material": "Two lodestones.",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "Cantrip",
        "school": "Transmutation",
        "class": "Cleric, Bard, Druid, Sorcerer, Wizard"
    },
    {
        "name": "Message",
        "desc": "<p>You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear.</p><p>You can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the spell. The spell doesn’t have to follow a straight line and can travel freely around corners or through openings.</p>",
        "page": "phb 259",
        "range": "120 feet",
        "components": "V, S, M",
        "material": "A short piece of copper wire.",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Transmutation",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Minor Illusion",
        "desc": "<p>You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.</p><p>If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.</p><p>If you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.</p><p>If a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.</p>",
        "page": "phb 260",
        "range": "30 feet",
        "components": "S, M",
        "material": "A bit of fleece.",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Illusion",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Mold Earth",
        "desc": "<p>You choose a portion of dirt or stone that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways:</p><p>- If you target an area of loose earth, you can instantaneously excavate it, move it along the ground, and deposit it up to 5 feet away. This movement doesn't have enough force to cause damage.</p><p>- You cause shapes, colors, or both to appear on the dirt or stone, spelling out words, creating images, or shaping patterns. The changes last for 1 hour.</p><p>- If the dirt or stone you target is on the ground, you cause it to become difficult terrain. Alternatively, you can cause the ground to become normal terrain if it is already difficult terrain. This change lasts for 1 hour. If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.</p>",
        "page": "ee pc 21",
        "range": "30 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Instantaneous/1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Poison Spray",
        "desc": "<p>You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a constitution saving throw or take 1d12 poison damage.</p><p>This spell’s damage increases by 1d12 when you reach 5th level (2d12), 11th level (3d12), and 17th level (4d12).</p>",
        "page": "phb 266",
        "range": "10 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Conjuration",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Prestidigitation",
        "desc": "<p>This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within 'range':</p><p>You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.</p><p>You instantaneously light or snuff out a candle, a torch, or a small campfire.</p><p>You instantaneously clean or soil an object no larger than 1 cubic foot.</p><p>You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.</p><p>You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.</p><p>You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn.</p><p>If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.</p>",
        "page": "phb 267",
        "range": "10 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Transmutation",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Ray of Frost",
        "desc": "<p>A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.</p><p>The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>",
        "page": "phb 271",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Shape Water",
        "desc": "<p>You choose an area of water that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways:</p><p>- You instantaneously move or otherwise change the flow of the water as you direct, up to 5 feet in any direction. This movement doesn't have enough force to cause damage.</p><p>- You cause the water to form into simple shapes and animate at your direction. This change lasts for 1 hour.</p><p>- You change the water's color or opacity. The water must be changed in the same way throughout. This change lasts for 1 hour.</p><p>- You freeze the water, provided that there are no creatures in it. The water unfreezes in 1 hour. If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.</p>",
        "page": "ee pc 21",
        "range": "30 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Instantaneous/1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Shocking Grasp",
        "desc": "<p>Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can’t take reactions until the start of its next turn.</p><p>The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>",
        "page": "phb 275",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Sword Burst",
        "desc": "<p>You create a momentary circle of spectral blades that sweep around you. Each creature within range, other than you, must succeed on a Dexterity saving throw or take 1d6 force damage.</p><p>This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>",
        "page": "scag 143",
        "range": "5 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Conjuration",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Thunderclap",
        "desc": "<p>You create a burst of thunderous sound, which can be heard 100 feet away. Each creature other than you within 5 feet of you must make a Constitution saving throw. On a failed save, the creature takes 1d6 thunder damage.</p><p>The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>",
        "page": "ee pc 22",
        "range": "Self (5-foot radius)",
        "components": "S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Evocation",
        "class": "Bard, Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "True Strike",
        "desc": "<p>You extend your hand and point a finger at a target in range. Your magic grants you a brief insight into the target’s defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn’t ended.</p>",
        "page": "phb 284",
        "range": "30 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Up to 1 round",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "Cantrip",
        "school": "Divination",
        "class": "Bard, Sorcerer, Warlock, Wizard"
    }
]